
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Перем ТЗНесоответствий;
	Если Не ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат;
	КонецЕсли; 	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПротоколАнализа") Тогда
		
		ДокументОснование = ДанныеЗаполнения;
		ДокументПоступления = ДанныеЗаполнения.ДокументПоступления;
		КодПродукта = ДанныеЗаполнения.КодПродукта;
		Номенклатура = ДанныеЗаполнения.Номенклатура;
		ДатаВведения = ДанныеЗаполнения.Дата;
		
		//0018202
		СрокДействияЭталона = Номенклатура.СрокГодности;
		ДатаОкончанияДействия = ДобавитьМесяц(ДанныеЗаполнения.Дата, СрокДействияЭталона);
		
		Партия = ДанныеЗаполнения.Партия;
		НомерЗамеса = ДанныеЗаполнения.НомерЗамеса;
		Организация = ДанныеЗаполнения.Организация;
		
		Если Лаборатория_Сервер.гл_ОбразецСоответствуетНормативам(ДанныеЗаполнения, , ДанныеЗаполнения.ТЧ_Показатели.Выгрузить(), ТЗНесоответствий) Тогда
		Иначе
			Сообщить("Протокол не соответсвует нормативам!");
			СтандартнаяОбработка = ЛОжь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Не ЗначениеЗаполнено(ПринялРешение) Тогда
		ПринялРешение = ПараметрыСеанса.ТекущийПользователь;
		Записать();
	КонецЕсли; 
	
	НабЗап = РегистрыСведений.ЭталоныПоОрганолептике.СоздатьНаборЗаписей();
	НабЗап.Отбор.Номенклатура.Установить(Номенклатура);
	НабЗап.Отбор.ДатаВведения.Установить(ДатаВведения);
	//НабЗап.Отбор.Регистратор.Установить(Ссылка);
	НовЗап = НабЗап.Добавить();
	НовЗап.Активность = Истина;
	НовЗап.Номенклатура = Номенклатура;
	НовЗап.ДатаВведения = ДатаВведения;
	НовЗап.ДатаОкончанияДействия = ДатаОкончанияДействия;
	НовЗап.Комментарий = Комментарий;
	НовЗап.КтоУтвердил = ПринялРешение;
	НовЗап.НомерЗамеса = НомерЗамеса;
	НовЗап.Серия = Серия;
	НовЗап.Регистратор = Ссылка;
	НовЗап.Период = ДатаВведения;
	НовЗап.Статус = Статус;	
	НабЗап.Записать();
	
КонецПроцедуры
