Перем СтруктураОбязательныхПолей Экспорт;

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Перем ТЗНесоответствий;
	Если Не ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат;
	КонецЕсли; 	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПротоколАнализа") Тогда
		//Пытаемся найти уже созданные карты на основании этого протокола
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	КартаРазрешения.Ссылка
		|ИЗ
		|	Документ.КартаРазрешения КАК КартаРазрешения
		|ГДЕ
		|	КартаРазрешения.ДокументОснование = &ДокументОснование";
		
		Запрос.УстановитьПараметр("ДокументОснование", ДанныеЗаполнения);
		
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			Сообщить("На основании протокола "+ ДанныеЗаполнения+ " уже создан документ "+Выборка.ссылка);
			СтрандартнаяОбработка = ЛОжь;
			Возврат;
		КонецЕсли; 	
		
		ДокументОснование = ДанныеЗаполнения;
		Протокол = ДокументОснование;
		Образец = ДанныеЗаполнения.Образец;
		ДокументПоступления = Образец.ДокументПоступления;
		КодПродукта = Образец.КодПродукта;
		Номенклатура = Образец.Номенклатура;
		Серия = Образец.СерияНоменклатуры;
		НомерЗамеса = Образец.НомерЗамеса;
		Организация = Образец.Организация;
		ВидИсследования = Образец.ВидИсследования;
		ДатаИзготовления = Образец.ДатаИзготовления;
		
		КомментарийЛаб = ДанныеЗаполнения.КомментарийДляПечати; //0013622
		Комментарий = ДанныеЗаполнения.КомментарийДляКартыРазрешения; //0020408
		//Разработки = ДанныеЗаполнения.Разработки;
		
		Если Лаборатория_Сервер.гл_ОбразецСоответствуетНормативам(ДанныеЗаполнения, , ДанныеЗаполнения.ТЧ_Показатели.Выгрузить(), ТЗНесоответствий) Тогда
			Сообщить("Протокол соответсвует нормативам!");
			СтандартнаяОбработка = ЛОжь;
		Иначе
			ТЧ_Показатели.Загрузить(ТЗНесоответствий);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КартаРазрешения") Тогда
		
		ДокументОснование = ДанныеЗаполнения;
		Протокол = ДокументОснование.Протокол; 
		ДокументПоступления = ДанныеЗаполнения.ДокументПоступления;
		КодПродукта = ДанныеЗаполнения.КодПродукта;
		Номенклатура = ДанныеЗаполнения.Номенклатура;
		Серия = ДанныеЗаполнения.Серия;
		Организация = ДанныеЗаполнения.Организация;
		ВидИсследования = ДанныеЗаполнения.ВидИсследования;
		НомерЗамеса = ДанныеЗаполнения.НомерЗамеса;
		ДатаИзготовления = ДанныеЗаполнения.ДатаИзготовления;
		
		ТЧ_Показатели.Загрузить(ДокументОснование.ТЧ_Показатели.Выгрузить());
		
		История = ДанныеЗаполнения.История+Символы.ПС+
		ДанныеЗаполнения + Символы.ПС+ СокрЛП(ДанныеЗаполнения.Комментарий) + Символы.ПС+ДанныеЗаполнения.ПринялРешение+ Символы.ПС+
		СокрЛП(ДанныеЗаполнения.ПринятоРешение)+ Символы.ПС +СокрЛП(ДанныеЗаполнения.КомментарийЛаб);
		
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Не ЗначениеЗаполнено(ПринялРешение) Тогда
		ПринялРешение = ПараметрыСеанса.ТекущийПользователь;
		Записать();
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Статус) Тогда
		Сообщить("Документ "+Ссылка);
		Сообщить("Не заполнен статус!");
		Отказ = Истина;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) //0020623
	
	//Если Не ЗначениеЗаполнено(ПлановаяДатаРеализации) Тогда
	//	ЗаполнитьДатуИзСменного();
	//КонецЕсли; 
	Если Не ЗначениеЗаполнено(Количество) Тогда
		ЗаполнитьКоличествоИзМЛП();
	КонецЕсли; 
	
КонецПроцедуры

Процедура ЗаполнитьКоличествоИзМЛП() Экспорт //0020623
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(МаршрутныйЛистПродукция.Количество) КАК Количество
	               |ИЗ
	               |	Документ.МаршрутныйЛист КАК МаршрутныйЛистПродукция
	               |ГДЕ
	               |	МаршрутныйЛистПродукция.Номенклатура = &Номенклатура
	               |	И МаршрутныйЛистПродукция.НомерСменыЗамеса = &НомерЗамеса
	               |	И МаршрутныйЛистПродукция.Дата МЕЖДУ &НачГода И &КонГода
	               |	И МаршрутныйЛистПродукция.Серия = &Серия";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура );
	Запрос.УстановитьПараметр("Серия", Серия );
	Запрос.УстановитьПараметр("НомерЗамеса", НомерЗамеса );
	
	Если ЗначениеЗаполнено(ДатаИзготовления) Тогда 
		Запрос.УстановитьПараметр("НачГода", НачалоГода(ДатаИзготовления));
		Запрос.УстановитьПараметр("КонГода", КонецГода(ДатаИзготовления));
	Иначе	
		Запрос.УстановитьПараметр("НачГода", НачалоГода(Дата));
		Запрос.УстановитьПараметр("КонГода", КонецГода(Дата));
	КонецЕсли; 
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Количество = Выборка.Количество;
	КонецЕсли;
	
КонецПроцедуры


