
&НаСервере
Процедура НоменклатураПриИзмененииНаСервере()
	Объект.ВидСырья = УправлениеСвойствами.ЗначениеСвойства(Объект.Номенклатура, "ВидПродукции(ВЕТИС)_5ee632ef8afb4eabac5c5c3b4babd429");   
	//Объект.ВидСырья = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Номенклатура, "ВидСырья_86cd3104a2944c7681b702076074ab10");   
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	НоменклатураПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИзТребованияНаСервере()
	
	Требование = Объект.ТребованияККачеству;
	Если Не ЗначениеЗаполнено(Требование) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле Требование!");
		Возврат;
	КонецЕсли; 
	
	//Если НЕ Требование.Статус = Перечисления.СтатусЗаявки.Согласована И НЕ Требование.Статус = Перечисления.СтатусЗаявки.ТребованияСформированы Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У требования недопустимый статус!");
	//	Возврат;
	//КонецЕсли; 
	
	ПараметрыФормы = Новый Структура("УтверждениеНорматива, ТребованияККачеству", Объект.Ссылка, Объект.ТребованияККачеству);
	ОповещениеОЗакрытие = Новый ОписаниеОповещения("ПослеЗакрытияФормыОбновленияИзТребования", ЭтотОбъект);
	ПараметрыОткрытияФормы = Новый Структура("Уникальность, Окно, НавигационнаяСсылка, Владелец", Ложь);
	
	ОткрытьФорму("Документ.УтверждениеНорматива.Форма.ФормаОбновленияИзТребования", ПараметрыФормы,
	ЭтаФорма, ПараметрыОткрытияФормы.Уникальность,
	ПараметрыОткрытияФормы.Окно, ПараметрыОткрытияФормы.НавигационнаяСсылка, ОповещениеОЗакрытие);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыОбновленияИзТребования(СтрукПараметров, ДопПараметры) Экспорт
	
    Если ТипЗнч(СтрукПараметров) = Тип("Структура") Тогда
        ЗагрузитьТЗВПоказатели(СтрукПараметров.АдресВХ);    
    КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТЗВПоказатели(АдресВХ)
	ТЗ = ПолучитьИзВременногоХранилища(АдресВХ);
	
	Для каждого Стр Из ТЗ Цикл
		Если НЕ СТр.Обновлять Тогда
			Продолжить;
		КонецЕсли; 
		
		ОтборЛ = Новый Структура();
		ОтборЛ.Вставить("Показатель", Стр.Показатель);
		
		СтрокиКонтроля = Объект.ТЧ_Показатели.НайтиСтроки(ОтборЛ);
		Если СтрокиКонтроля.Количество()=00 Тогда
			СтрКонтроля = Объект.ТЧ_Показатели.Добавить();
			СтрКонтроля.Показатель = Стр.Показатель;
		Иначе
			СтрКонтроля = СтрокиКонтроля[0];
		КонецЕсли;
		СтрКонтроля.ВидИсследования = Стр.ВидИсследованияТреб;
		СтрКонтроля.Значение = Стр.ЗначениеПоказателяТреб;
		СтрКонтроля.Периодичность = Стр.ПериодичностьТреб;
		СтрКонтроля.ВариантСравнения = Стр.ВариантСравненияТреб;
		СтрКонтроля.Интервал = Стр.ИнтервалТреб;
		//СтрКонтроля.ППК = Стр.ПериодичностьСторонняя;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИзТребования(Команда)
	
	Если ЭтаФорма.Модифицированность Тогда
		Ответ =Вопрос("Надо записать документ. Запишем?", РежимДиалогаВопрос.ДаНет);
		Если НЕ Ответ = КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли; 
		Объект.Записать();	
	КонецЕсли;
	
	ОбновитьИзТребованияНаСервере();
	
КонецПроцедуры
