Функция ЭтоЧисло(Слово) Экспорт
	
	Цифры = "1234567890.,";
	
	Для НомСимвола = 1 По СтрДлина(Слово) Цикл
		
		Если Найти(Цифры, Сред(Слово, НомСимвола, 1)) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина
	
КонецФункции

Функция НайтиСоздатьСерию(Номер, Номенклатура, Производитель = Неопределено, ДатаИзготовления = Неопределено, ГоденДо = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СерииНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|ГДЕ
	//|	СерииНоменклатуры.бит_Номенклатура = &Номенклатура
	|	 СерииНоменклатуры.Номер = &Номер";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Номер", Номер);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Серия = Выборка.Ссылка;
	Иначе
		СерияОб = Справочники.СерииНоменклатуры.СоздатьЭлемент();
		СерияОб.Номер = Номер;
		//СерияОб.бит_Номенклатура = Номенклатура;
		//СерияОб.бит_Производитель = Производитель;
		//СерияОб.бит_ДатаПроизводства = ДатаИзготовления;
		СерияОб.ВидНоменклатуры = Номенклатура.ВидНоменклатуры;
		СерияОб.ДатаПроизводства = ДатаИзготовления;
		СерияОб.ГоденДо = ГоденДо;
		СерияОб.Записать();
		Серия = СерияОб.Ссылка;
	КонецЕсли;   
	
	Возврат Серия;
	
КонецФункции // ()
 
Функция гл_ОбразецСоответствуетНормативам_ВЛаборатории(парам_ПротоколАнализа, парам_СписокПоказателей = "", ТЧ, ТЗНесоответствий=Неопределено) Экспорт
	лСписокПоказателейНесоответствия = Новый СписокЗначений;
	лРезультат = Истина;
	
	//создаем структуру ТЗНесоответствий
	Если ТипЗнч(ТЧ) = Тип("ТаблицаЗначений") Тогда
		ТЗНесоответствий = ТЧ.Скопировать();
	Иначе		
		ТЗНесоответствий = ТЧ.Выгрузить();
	КонецЕсли;
	ТЗНесоответствий.Очистить();
	ТЗНесоответствий.Колонки.Добавить("НормативноеЗначение");
	
	Для каждого лСтрокаТЧПоказатели Из ТЧ Цикл
		лЗначениеФакт = лСтрокаТЧПоказатели.Значение;
		лИнтервал = "";
		лВариантСравнения = "";
		
		лДопустимоеОтклонение = "";
		лЗначениеНорматива = Лаборатория_Сервер.гл_ПолучитьЗначениеНорматива(парам_ПротоколАнализа.Номенклатура, парам_ПротоколАнализа.ВидИсследования, лСтрокаТЧПоказатели.Показатель, лВариантСравнения, лИнтервал,,,парам_ПротоколАнализа.Дата, лДопустимоеОтклонение);
		
		//27.11.2018 потому что должны брать данные из документа
		лВариантСравнения = лСтрокаТЧПоказатели.ВариантСравнения;
		лЗначениеНорматива = лСтрокаТЧПоказатели.ЗначениеПоТУ;
		
		//Если НЕ лЗначениеНорматива = "" Тогда 
		Если ЗначениеЗаполнено(лЗначениеНорматива) Тогда 
			//Значение норматива не пустое
			
			Если (ТипЗНЧ(лЗначениеНорматива) = Тип("Число")) ИЛИ (ТипЗНЧ(лЗначениеНорматива) = Тип("Дата")) Тогда
				//устанавливаем по умолчанию
				лСтрокаТЧПоказатели.Статус = Перечисления.СтатусРезультатаИсследований.соответствует;
				//если отклоение не число - то ставим его равным 0
				Если НЕ ЗначениеЗаполнено(лДопустимоеОтклонение) Тогда
				    лДопустимоеОтклонение = 0;
				КонецЕсли; 
				Если НЕ ТипЗнч(лДопустимоеОтклонение) = Тип("Число") Тогда
					лДопустимоеОтклонение = 0;
				КонецЕсли;
				
				//brava погрешности
				Если лДопустимоеОтклонение = 0 Тогда
				    лДопустимоеОтклонение = лСтрокаТЧПоказатели.Погрешность;
				КонецЕсли; 
				
				//Сравнение числовых значений и дат
				Если ЗначениеЗаполнено(лВариантСравнения) Тогда
					Если лВариантСравнения = Перечисления.ВариантыСравнения.НеБолее Тогда
						//Меньше или равно
						//лЗначениеНорматива = лЗначениеНорматива + лДопустимоеОтклонение;
						Если НЕ лЗначениеФакт <= лЗначениеНорматива +лДопустимоеОтклонение Тогда
							//Значение не соответствует нормативному
							лСписокПоказателейНесоответствия.Добавить(лСтрокаТЧПоказатели.Показатель);
							лСтрокаТЧПоказатели.Статус = Перечисления.СтатусРезультатаИсследований.несоответствует;
							лСтрокаТЧПоказатели.Комментарий = "";
							ДобавитьСтрВТЗНесоотв(лСтрокаТЧПоказатели, ТЗНесоответствий, лЗначениеНорматива);
						Иначе
							//инц 0015149 brava
							//в нормативе, но только по погрешности
							Если лЗначениеФакт > лЗначениеНорматива - лДопустимоеОтклонение Тогда
								лСтрокаТЧПоказатели.Комментарий = "Входит в погрешность метода";
							Иначе
								лСтрокаТЧПоказатели.Комментарий = "";
							КонецЕсли;
						КонецЕсли; 
					ИначеЕсли лВариантСравнения = Перечисления.ВариантыСравнения.Менее Тогда //0019391
						//Меньше
						//лЗначениеНорматива = лЗначениеНорматива + лДопустимоеОтклонение;
						Если НЕ лЗначениеФакт < лЗначениеНорматива +лДопустимоеОтклонение Тогда
							//Значение не соответствует нормативному
							лСписокПоказателейНесоответствия.Добавить(лСтрокаТЧПоказатели.Показатель);
							лСтрокаТЧПоказатели.Статус = Перечисления.СтатусРезультатаИсследований.несоответствует;
							лСтрокаТЧПоказатели.Комментарий = "";
							ДобавитьСтрВТЗНесоотв(лСтрокаТЧПоказатели, ТЗНесоответствий, лЗначениеНорматива);
						Иначе
							//инц 0015149 brava
							//в нормативе, но только по погрешности
							Если лЗначениеФакт > лЗначениеНорматива - лДопустимоеОтклонение Тогда
								лСтрокаТЧПоказатели.Комментарий = "Входит в погрешность метода";
							Иначе
								лСтрокаТЧПоказатели.Комментарий = "";
							КонецЕсли;
						КонецЕсли; 
						
					ИначеЕсли лВариантСравнения = Перечисления.ВариантыСравнения.НеМенее Тогда 
						//лЗначениеНорматива = лЗначениеНорматива - лДопустимоеОтклонение;
						//Больше или равно
						Если НЕ лЗначениеФакт >= лЗначениеНорматива - лДопустимоеОтклонение Тогда
							//Значение не соответствует нормативному
							лСписокПоказателейНесоответствия.Добавить(лСтрокаТЧПоказатели.Показатель);
							лСтрокаТЧПоказатели.Статус = Перечисления.СтатусРезультатаИсследований.несоответствует;
							лСтрокаТЧПоказатели.Комментарий = "";
							ДобавитьСтрВТЗНесоотв(лСтрокаТЧПоказатели, ТЗНесоответствий, лЗначениеНорматива);
						Иначе
							//инц 0015149 brava
							//в нормативе, но только по погрешности
							Если лЗначениеФакт < лЗначениеНорматива + лДопустимоеОтклонение Тогда
								лСтрокаТЧПоказатели.Комментарий = "Входит в погрешность метода";
							Иначе
								лСтрокаТЧПоказатели.Комментарий = "";
							КонецЕсли;
						КонецЕсли; 
					ИначеЕсли лВариантСравнения = Перечисления.ВариантыСравнения.ВИнтервале Тогда 
						//В интервале (плюс-минус)
						Если (лЗначениеФакт >= лЗначениеНорматива - лИнтервал - лДопустимоеОтклонение) И (лЗначениеФакт <= лЗначениеНорматива + лИнтервал+лДопустимоеОтклонение) Тогда
							//инц 0015149 brava
							//в нормативе, но только по погрешности
							Если (лЗначениеФакт >= лЗначениеНорматива - лИнтервал) И (лЗначениеФакт <= лЗначениеНорматива + лИнтервал) Тогда
								лСтрокаТЧПоказатели.Комментарий = "";
							Иначе
								лСтрокаТЧПоказатели.Комментарий = "Входит в погрешность метода";
							КонецЕсли;
						Иначе	
							//Значение не соответствует нормативному
							лСписокПоказателейНесоответствия.Добавить(лСтрокаТЧПоказатели.Показатель);
							лСтрокаТЧПоказатели.Статус = Перечисления.СтатусРезультатаИсследований.несоответствует;
							лСтрокаТЧПоказатели.Комментарий = "";
							ДобавитьСтрВТЗНесоотв(лСтрокаТЧПоказатели, ТЗНесоответствий, лЗначениеНорматива)
						КонецЕсли; 
					ИначеЕсли лВариантСравнения = Перечисления.ВариантыСравнения.Между Тогда 
						//В интервале (от и до)
						Если (лЗначениеФакт >= лЗначениеНорматива - лДопустимоеОтклонение) И (лЗначениеФакт <= лИнтервал + лДопустимоеОтклонение) Тогда
							//инц 0015149 brava
							//в нормативе, но только по погрешности
							Если (лЗначениеФакт >= лЗначениеНорматива) И (лЗначениеФакт <= лИнтервал) Тогда
								лСтрокаТЧПоказатели.Комментарий = "";
							Иначе
								лСтрокаТЧПоказатели.Комментарий = "Входит в погрешность метода";
							КонецЕсли;
						Иначе	
							//Значение не соответствует нормативному
							лСписокПоказателейНесоответствия.Добавить(лСтрокаТЧПоказатели.Показатель);
							лСтрокаТЧПоказатели.Статус = Перечисления.СтатусРезультатаИсследований.несоответствует;
							лСтрокаТЧПоказатели.Комментарий = "";
							ДобавитьСтрВТЗНесоотв(лСтрокаТЧПоказатели, ТЗНесоответствий, лЗначениеНорматива)
						КонецЕсли; 
					КонецЕсли; 
					
				Иначе
					//если вариант не выбран - то статус не заполяем с 27.11.2018 brava
					//закоментировал 29.11.2018 потому что статус может быть проставлен ЦИРом
					Если парам_ПротоколАнализа.Заявка = Ложь Тогда
						лСтрокаТЧПоказатели.Статус = Перечисления.СтатусРезультатаИсследований.ПустаяСсылка();
					КонецЕсли; 
					

					////Вариант сравнения - РАВНО
					////Если НЕ лЗначениеФакт = лЗначениеНорматива Тогда
					////из-за отклонения даже равно становится интервалом
					//Если (лЗначениеФакт >= лЗначениеНорматива + лДопустимоеОтклонение) И (лЗначениеФакт <= лИнтервал - лДопустимоеОтклонение) Тогда
					//	//Значение не соответствует нормативному
					//	лСписокПоказателейНесоответствия.Добавить(лСтрокаТЧПоказатели.Показатель);
					//	лСтрокаТЧПоказатели.Статус = Перечисления.СтатусРезультатаИсследований.несоответствует;
					//	лСтрокаТЧПоказатели.Комментарий = "";
					//	ДобавитьСтрВТЗНесоотв(лСтрокаТЧПоказатели, ТЗНесоответствий, лЗначениеНорматива);
					//Иначе
					//	//инц 0015149 brava
					//	//в нормативе, но только по погрешности
					//	Если НЕ лЗначениеФакт = лЗначениеНорматива Тогда
					//		лСтрокаТЧПоказатели.Комментарий = "Входит в погрешность метода";
					//	Иначе
					//		лСтрокаТЧПоказатели.Комментарий = "";
					//	КонецЕсли;
					//КонецЕсли; 
				КонецЕсли; 
			ИначеЕсли ТипЗНЧ(лЗначениеНорматива) = Тип("Строка") Тогда
				//brava
				Если лСтрокаТЧПоказатели.Статус = Перечисления.СтатусРезультатаИсследований.соответствует Тогда
					Продолжить;
				КонецЕсли;
				лСтрокаТЧПоказатели.Статус = Перечисления.СтатусРезультатаИсследований.соответствует;
				//brava
				//Строки сравниваются по равенству, либо по соответствию Не допускается = Отсутствует (-ют)
				Если Найти(НРЕГ(лЗначениеНорматива), "не допуска") Тогда
					Если (Найти(НРЕГ(лЗначениеФакт), "отсутству") = 0) И (НЕ НРЕГ(СОКРЛП(лЗначениеФакт)) = НРЕГ(СОКРЛП(лЗначениеНорматива))
						// олег
						И (Найти(НРЕГ(лЗначениеФакт), "не обнаружен") = 0)
						// олег
						
						) Тогда
						//Значение не соответствует нормативному
						лСписокПоказателейНесоответствия.Добавить(лСтрокаТЧПоказатели.Показатель);
						лСтрокаТЧПоказатели.Статус = Перечисления.СтатусРезультатаИсследований.несоответствует;
						ДобавитьСтрВТЗНесоотв(лСтрокаТЧПоказатели, ТЗНесоответствий, лЗначениеНорматива)
					КонецЕсли;
				ИначеЕсли Найти(НРЕГ(лЗначениеФакт), "не соответству") Тогда
					лСписокПоказателейНесоответствия.Добавить(лСтрокаТЧПоказатели.Показатель);
					лСтрокаТЧПоказатели.Статус = Перечисления.СтатусРезультатаИсследований.несоответствует;
					ДобавитьСтрВТЗНесоотв(лСтрокаТЧПоказатели, ТЗНесоответствий, лЗначениеНорматива)
				ИначеЕсли Найти(НРЕГ(лЗначениеФакт), "соответству") Тогда
					//Значение соответствует нормативному
				Иначе
					Если НЕ НРЕГ(СОКРЛП(лЗначениеФакт)) = НРЕГ(СОКРЛП(лЗначениеНорматива)) Тогда
						//Значение не соответствует нормативному
						лСписокПоказателейНесоответствия.Добавить(лСтрокаТЧПоказатели.Показатель);
						лСтрокаТЧПоказатели.Статус = Перечисления.СтатусРезультатаИсследований.несоответствует;
						ДобавитьСтрВТЗНесоотв(лСтрокаТЧПоказатели, ТЗНесоответствий, лЗначениеНорматива)
					КонецЕсли; 
				КонецЕсли; 
			КонецЕсли;
		Иначе
			//закоментировал 29.11.2018 потому что статус может быть проставлен ЦИРом
			Если парам_ПротоколАнализа.Заявка = Ложь Тогда
				лСтрокаТЧПоказатели.Статус = Перечисления.СтатусРезультатаИсследований.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
	Если лСписокПоказателейНесоответствия.Количество() > 0 Тогда
		лРезультат = Ложь;
		парам_СписокПоказателей = лСписокПоказателейНесоответствия;	
	КонецЕсли; 
	
	Возврат лРезультат;
КонецФункции

Процедура ДобавитьСтрВТЗНесоотв(СтрТЧ, ТЗНесоотв, НормативноеЗначение)

	НовСтрТЗНесоотв = ТЗНесоотв.Добавить();
	ЗаполнитьЗначенияСвойств(НовСтрТЗНесоотв, СтрТЧ);
	НовСтрТЗНесоотв.НормативноеЗначение = НормативноеЗначение;

КонецПроцедуры

Функция ПолучитьСписокАналогов(ВидСырья) Экспорт
	
	СЗ = Новый СписокЗначений;
	
	Если НЕ ЗначениеЗаполнено(ВидСырья) Тогда
		Возврат СЗ;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВидыСырьяАналогиСырья.Аналог КАК Аналог
	               |ИЗ
	               |	Справочник.ВидыСырья.АналогиСырья КАК ВидыСырьяАналогиСырья
	               |ГДЕ
	               |	ВидыСырьяАналогиСырья.Ссылка = &ВС";
	
	Запрос.УстановитьПараметр("ВС", ВидСырья);
	
	Мас = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Аналог");
	СЗ.ЗагрузитьЗначения(Мас);
	
	Возврат СЗ;
	
КонецФункции // ()