
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура("АдресВХранилище",ПоместитьТоварыВХранилище(ПараметрКоманды));
	
	ОткрытьФорму("Обработка.ПечатьЭтикетокИЦенников.Форма.ФормаТовары", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

&Насервере
Функция ПоместитьТоварыВХранилище(СсылкаДокумент)
	
		Порядок  = 1;
		ТипЧисло = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Неотрицательный));
		
		
		Товары = Новый ТаблицаЗначений;
		Товары.Колонки.Добавить("Порядок",        ТипЧисло);
		Товары.Колонки.Добавить("Номенклатура",   Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		Товары.Колонки.Добавить("Упаковка",       Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
		Товары.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
		Товары.Колонки.Добавить("Количество",     ТипЧисло);
		

		для Каждого СтрокаТовара из СсылкаДокумент.Товары Цикл
			НовСтрока = Товары.Добавить();
			НовСтрока.Номенклатура = СтрокаТовара.Номенклатура;
			НовСтрока.Характеристика = СтрокаТовара.Характеристика;
			НовСтрока.Количество = СтрокаТовара.КоличествоПлан;
			
			Порядок  = Порядок + 1;
		КонецЦикла;	
		
		для Каждого СтрокаТовара из СсылкаДокумент.вт_БракДробленка Цикл
			НовСтрока = Товары.Добавить();
			НовСтрока.Номенклатура = СтрокаТовара.Дробленка;
			НовСтрока.Характеристика = СтрокаТовара.Характеристика;
			НовСтрока.Количество = СтрокаТовара.Количество;
			
			Порядок  = Порядок + 1;
		КонецЦикла;	
		
		СтруктураДействий = Новый Структура;
		
		СтруктураДействий.Вставить("ЗаполнитьОрганизацию",СсылкаДокумент.Организация);
		СтруктураДействий.Вставить("ЗаполнитьСклад",СсылкаДокумент.Склад);
		СтруктураДействий.Вставить("ПоказыватьКолонкуКоличествоВДокументе",Истина);
		СтруктураДействий.Вставить("УстановитьРежимПечатиИзДокумента",Истина);

		СтруктураДанных = Новый Структура("Товары,СтруктураДействий",Товары,Неопределено);
			
		Возврат ПоместитьВоВременноеХранилище(СтруктураДанных);
КонецФункции 