
&НаКлиенте
Процедура Печать(Команда)
	
	МассивОбъектов = Элементы.Список.ВыделенныеСтроки;
    ТабДок = ПечатьНаСервере(МассивОбъектов);  
    
    ТабДок.ПолеСлева 			   = 5;
	ТабДок.ПолеСправа 			   = 5;
	ТабДок.РазмерКолонтитулаСверху = 0;
	ТабДок.РазмерКолонтитулаСнизу  = 0;
	ТабДок.АвтоМасштаб 		   	   = Истина;
    ТабДок.ОтображатьСетку 	   	   = Ложь;
    ТабДок.ОтображатьЗаголовки     = Ложь;
	ТабДок.ОриентацияСтраницы      = ОриентацияСтраницы.Портрет;    
    
    //ТабДок.Показать("Заявка в производство", "ЗаявкаВПроизводство.xls");
    ОбластиОбъектов = Неопределено;
	ИдентификаторПечатнойФормы = "ПФ_ЗаявкаВПроизводство";   	
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИдентификаторПечатнойФормы);
	ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, ИдентификаторПечатнойФормы);
	ПечатнаяФорма.СинонимМакета = НСтр("ru = 'ПФ_ЗаявкаВПроизводство'");
	ПечатнаяФорма.ТабличныйДокумент = ТабДок;
	ПечатнаяФорма.ИмяФайлаПечатнойФормы = НСтр("ru = 'ПФ_ЗаявкаВПроизводство'");	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, ОбластиОбъектов);

КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере(МассивОбъектов)
	Возврат Документы.вт_ЗаказВПроизводство.ПечатьЗаказВпроизводство(МассивОбъектов);	
КонецФункции	

&НаКлиенте
Процедура ПечатьСОстатком(Команда)
	
	МассивОбъектов = Элементы.Список.ВыделенныеСтроки;  
	ТабДок = ПечатьНаСервереСОстатком(МассивОбъектов);  
	
	ТабДок.ПолеСлева 			   = 5;
	ТабДок.ПолеСправа 			   = 5;
	ТабДок.РазмерКолонтитулаСверху = 0;
	ТабДок.РазмерКолонтитулаСнизу  = 0;
	ТабДок.АвтоМасштаб 		   	   = Истина;
	ТабДок.ОтображатьСетку 	   	   = Ложь;
	ТабДок.ОтображатьЗаголовки     = Ложь;
	ТабДок.ОриентацияСтраницы      = ОриентацияСтраницы.Портрет;    
	
	//ТабДок.Показать("Заявка в производство с остатком", "ЗаявкаВПроизводствоСОстатком.xls");
	ОбластиОбъектов = Неопределено;
	ИдентификаторПечатнойФормы = "ПФ_ЗаявкаВПроизводствоСОстатком";   	
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИдентификаторПечатнойФормы);
	ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, ИдентификаторПечатнойФормы);
	ПечатнаяФорма.СинонимМакета = НСтр("ru = 'ПФ_ЗаявкаВПроизводствоСОстатком'");
	ПечатнаяФорма.ТабличныйДокумент = ТабДок;
	ПечатнаяФорма.ИмяФайлаПечатнойФормы = НСтр("ru = 'ПФ_ЗаявкаВПроизводствоСОстатком'");	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, ОбластиОбъектов);
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервереСОстатком(МассивОбъектов)
	Возврат Документы.вт_ЗаказВПроизводство.ПечатьЗаказВпроизводствоСОстатком(МассивОбъектов);	
КонецФункции	

&НаСервере
Функция ПечатьНаСервереПотребностьВСырье(МассивОбъектов)
	Возврат Документы.вт_ЗаказВПроизводство.ПечатьЗаказВпроизводствоССырьемИОстатком(МассивОбъектов);
КонецФункции

&НаКлиенте
Процедура ПотребностьВСырье(Команда)
	МассивОбъектов = Элементы.Список.ВыделенныеСтроки;  
	ТабДок = ПечатьНаСервереПотребностьВСырье(МассивОбъектов);  
    
    ТабДок.ПолеСлева 			   = 5;
	ТабДок.ПолеСправа 			   = 5;
	ТабДок.РазмерКолонтитулаСверху = 0;
	ТабДок.РазмерКолонтитулаСнизу  = 0;
	ТабДок.АвтоМасштаб 		   	   = Истина;
    ТабДок.ОтображатьСетку 	   	   = Ложь;
    ТабДок.ОтображатьЗаголовки     = Ложь;
	ТабДок.ОриентацияСтраницы      = ОриентацияСтраницы.Портрет;    
    
    //ТабДок.Показать("Потребность в сырье", "ПотребностьВСырье.xls");
    ОбластиОбъектов = Неопределено;
	ИдентификаторПечатнойФормы = "ПФ_ПотребностьВСырье";   	
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИдентификаторПечатнойФормы);
	ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, ИдентификаторПечатнойФормы);
	ПечатнаяФорма.СинонимМакета = НСтр("ru = 'ПФ_ПотребностьВСырье'");
	ПечатнаяФорма.ТабличныйДокумент = ТабДок;
	ПечатнаяФорма.ИмяФайлаПечатнойФормы = НСтр("ru = 'ПФ_ПотребностьВСырье'");	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, ОбластиОбъектов);

КонецПроцедуры

&НаКлиенте
Процедура ПечатьЗаказНаряда(Команда)
	МассивОбъектов = Элементы.Список.ВыделенныеСтроки;   	
	ТабДок = ПечатьНаСервереЗаказНаряда(МассивОбъектов);
	
	ТабДок.ПолеСлева 			   = 5;
	ТабДок.ПолеСправа 			   = 5;
	ТабДок.РазмерКолонтитулаСверху = 0;
	ТабДок.РазмерКолонтитулаСнизу  = 0;
	ТабДок.АвтоМасштаб 		   	   = Истина;
	ТабДок.ОтображатьСетку 	   	   = Ложь;
	ТабДок.ОтображатьЗаголовки     = Ложь;
	ТабДок.ОриентацияСтраницы      = ОриентацияСтраницы.Портрет;    
	
	//ТабДок.Показать("Заказ-наряд", "Заказ_наряд.xls");
	ОбластиОбъектов = Неопределено;
	ИдентификаторПечатнойФормы = "ПФ_ЗаказНаряда";   	
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИдентификаторПечатнойФормы);
	ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, ИдентификаторПечатнойФормы);
	ПечатнаяФорма.СинонимМакета = НСтр("ru = 'ПФ_ЗаказНаряда'");
	ПечатнаяФорма.ТабличныйДокумент = ТабДок;
	ПечатнаяФорма.ИмяФайлаПечатнойФормы = НСтр("ru = 'ПФ_ЗаказНаряда'");	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, ОбластиОбъектов);
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервереЗаказНаряда(МассивОбъектов)
	Возврат Документы.вт_ЗаказВПроизводство.ПечатьЗаказНаряда(МассивОбъектов);
КонецФункции
