
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТребованияККачеству") Тогда
		Требование = Параметры.ТребованияККачеству;
		УтверждениеНорматива = Параметры.УтверждениеНорматива;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Утверждение.Показатель КАК Показатель,
		               |	Утверждение.ВидИсследования КАК ВидИсследования,
		               |	Утверждение.ЗначениеПоказателя КАК ЗначениеПоказателя,
		               |	Утверждение.Периодичность КАК Периодичность,
		               |	Требование.ПоказательТреб КАК ПоказательТреб,
		               |	Требование.ВидИсследованияТреб КАК ВидИсследованияТреб,
		               |	Требование.ЗначениеПоказателяКонечные КАК ЗначениеПоказателяТреб,
		               |	Требование.ПериодичностьТреб КАК ПериодичностьТреб,
		               |	ИСТИНА КАК Обновлять,
		               |	Требование.ЗначениеПоказателяКонечные КАК ЗначениеПоказателяКонечные,
		               |	Утверждение.ВариантСравнения КАК ВариантСравнения,
		               |	Утверждение.Интервал КАК Интервал,
		               |	Требование.ВариантСравненияТреб КАК ВариантСравненияТреб,
		               |	Требование.ИнтервалТреб КАК ИнтервалТреб,
		               |	Требование.ПериодичностьСторонняя КАК ПериодичностьСторонняя
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		УтвПоказатели.Показатель КАК Показатель,
		               |		УтвПоказатели.Показатель.ВидИсследования КАК ВидИсследования,
		               |		УтвПоказатели.Значение КАК ЗначениеПоказателя,
		               |		УтвПоказатели.Периодичность КАК Периодичность,
		               |		УтвПоказатели.ВариантСравнения КАК ВариантСравнения,
		               |		УтвПоказатели.Интервал КАК Интервал
		               |	ИЗ
		               |		Документ.УтверждениеНорматива.ТЧ_Показатели КАК УтвПоказатели
		               |	ГДЕ
		               |		УтвПоказатели.Ссылка = &УтверждениеНорматива) КАК Утверждение
		               |		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			ТребовПоказатели.Показатель КАК ПоказательТреб,
		               |			ТребовПоказатели.ВидИсследования КАК ВидИсследованияТреб,
		               |			ТребовПоказатели.Периодичность КАК ПериодичностьТреб,
		               |			ТребовПоказатели.ЗначениеПоказателяКонечные КАК ЗначениеПоказателяКонечные,
		               |			ТребовПоказатели.Ссылка.Статус КАК Статус,
		               |			ТребовПоказатели.ВариантСравнения КАК ВариантСравненияТреб,
		               |			ТребовПоказатели.Интервал КАК ИнтервалТреб,
		               |			ТребовПоказатели.ПериодичностьСторонняя КАК ПериодичностьСторонняя
		               |		ИЗ
		               |			Документ.ТребованияККачествуЗакупаемогоТовара.ТЧ_Показатели КАК ТребовПоказатели
		               |		ГДЕ
		               |			ТребовПоказатели.Ссылка = &Требование
		               |			И НЕ ТребовПоказатели.Периодичность = ЗНАЧЕНИЕ(Справочник.ПериодичностьИспытаний.ПустаяСсылка)) КАК Требование
		               |		ПО Утверждение.Показатель = Требование.ПоказательТреб";
		
		Запрос.УстановитьПараметр("УтверждениеНорматива", УтверждениеНорматива);
		Запрос.УстановитьПараметр("Требование", Требование);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			НовСтр = ТЗПоказатели.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
			
			//Если НовСтр.ВариантСравненияТреб = Перечисления.ВариантыСравнения.Между Тогда
			//	ЗначКон = НовСтр.ЗначениеПоказателяТреб;
			//	Дефис = Найти(ЗначКон, "-");
			//	Если Дефис>0 Тогда
			//		НовСтр.ЗначениеПоказателяТреб = Сред(ЗначКон, 1, Дефис-1);
			//		НовСтр.ИнтервалТреб = Сред(ЗначКон, Дефис+1);
			//	КонецЕсли; 
			//КонецЕсли; 
			
		КонецЦикла;
		
		//ЭлементыФормы.ТЗПоказатели.ОбновитьСтроки();
		
		Если ЗначениеЗаполнено(Требование) Тогда
			Элементы.КомментарийТребования.Заголовок = "Коммент в требовании: "+Требование.Комментарий;		
		КонецЕсли;
		
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередатьДанныеВОсновнуюформуНаСервере(АдресВХ)
	
	ТЗ = РеквизитФормыВЗначение("ТЗПоказатели");
	АдресВХ = ПоместитьВоВременноеХранилище(ТЗ, Новый УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура Принять(Команда)
	
	АдресВХ = Неопределено;
	ПередатьДанныеВОсновнуюформуНаСервере(АдресВХ);
	
	ПараметрыПриЗакрытии = Новый Структура;
	ПараметрыПриЗакрытии.Вставить("АдресВХ",АдресВХ);
	
	//ВладелецФормы.ОбработатьПодбор(ПараметрыПриЗакрытии);
	//Закрыть(ПараметрыПриЗакрытии);
	ОповеститьОВыборе(ПараметрыПриЗакрытии);	
	//Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьВсеНаСервере(Галочка)
	Для каждого Стр Из ТЗПоказатели Цикл
	    Стр.Обновлять = Галочка
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура УбратьВсе(Команда)
	ИзменитьВсеНаСервере(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПоставитьВсе(Команда)
	ИзменитьВсеНаСервере(Истина);
КонецПроцедуры
