
//&НаСервере
//Процедура ЗагрузитьНаСервере()
//	
//	Соответствие = ЗагрузитьСоответствие();
//	
//	Объект.Список.Очистить();
//	
//	Запрос = Новый Запрос;
//	
//	Если ЗагрузитьВыпуск Тогда
//	
//		Запрос.Текст = 
//			"ВЫБРАТЬ
//			|	вт_ОтчетПроизводства.Ссылка КАК Ссылка,
//			|	вт_ОтчетПроизводстваТовары.Серия КАК Серия
//			|ПОМЕСТИТЬ ВТ_Список
//			|ИЗ
//			|	Документ.вт_ОтчетПроизводства КАК вт_ОтчетПроизводства
//			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.вт_ОтчетПроизводства.Товары КАК вт_ОтчетПроизводстваТовары
//			|		ПО (вт_ОтчетПроизводства.Ссылка = вт_ОтчетПроизводстваТовары.Ссылка)
//			|ГДЕ
//			|	вт_ОтчетПроизводства.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
//			|	И вт_ОтчетПроизводства.Проведен
//			|	И вт_ОтчетПроизводства.Склад.ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач
//			|
//			|СГРУППИРОВАТЬ ПО
//			|	вт_ОтчетПроизводства.Ссылка,
//			|	вт_ОтчетПроизводстваТовары.Серия
//			|;
//			|
//			|////////////////////////////////////////////////////////////////////////////////
//			|ВЫБРАТЬ
//			|	ВТ_Список.Ссылка КАК Ссылка,
//			|	ВТ_Список.Серия КАК Серия
//			|ИЗ
//			|	ВТ_Список КАК ВТ_Список ";
//			//|ГДЕ
//			//|	ВТ_Список.Серия = &Серия";
//		
//		
//	ИначеЕсли ЗагрузитьРеализацию Тогда
//		
//		Запрос.Текст = 
//			"ВЫБРАТЬ
//			|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
//			|	РеализацияТоваровУслугТовары.Серия КАК Серия
//			|ПОМЕСТИТЬ ВТ_Список
//			|ИЗ
//			|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
//			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
//			|		ПО РеализацияТоваровУслуг.Ссылка = РеализацияТоваровУслугТовары.Ссылка
//			|ГДЕ
//			|	РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
//			|	И РеализацияТоваровУслуг.Проведен
//			|	И РеализацияТоваровУслуг.Склад.ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач
//			|
//			|СГРУППИРОВАТЬ ПО
//			|	РеализацияТоваровУслуг.Ссылка,
//			|	РеализацияТоваровУслугТовары.Серия
//			|;
//			|
//			|////////////////////////////////////////////////////////////////////////////////
//			|ВЫБРАТЬ
//			|	ВТ_Список.Ссылка КАК Ссылка,
//			|	ВТ_Список.Серия КАК Серия
//			|ИЗ
//			|	ВТ_Список КАК ВТ_Список ";
//			//|ГДЕ
//			//|	ВТ_Список.Серия = &Серия";
//			
//		
//	
//	ИначеЕсли ЗагрузитьПеремещения Тогда
//		
//		Запрос.Текст = 
//			"ВЫБРАТЬ
//			|	ПеремещениеТоваров.Ссылка КАК Ссылка,
//			|	ПеремещениеТоваровТовары.Серия КАК Серия
//			|ПОМЕСТИТЬ ВТ_Список
//			|ИЗ
//			|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
//			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
//			|		ПО ПеремещениеТоваров.Ссылка = ПеремещениеТоваровТовары.Ссылка
//			|ГДЕ
//			|	ПеремещениеТоваров.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
//			|	И ПеремещениеТоваров.Проведен
//			|
//			|СГРУППИРОВАТЬ ПО
//			|	ПеремещениеТоваров.Ссылка,
//			|	ПеремещениеТоваровТовары.Серия
//			|;
//			|
//			|////////////////////////////////////////////////////////////////////////////////
//			|ВЫБРАТЬ
//			|	ВТ_Список.Ссылка КАК Ссылка,
//			|	ВТ_Список.Серия КАК Серия
//			|ИЗ
//			|	ВТ_Список КАК ВТ_Список ";
//			//|ГДЕ
//			//|	ВТ_Список.Серия = &Серия";
//		
//		
//	ИначеЕсли ЗагрузитьПоступления Тогда

//		Запрос.Текст = 
//			"ВЫБРАТЬ
//			|	ПриобретениеТоваровУслуг.Ссылка КАК Ссылка,
//			|	ПриобретениеТоваровУслугТовары.Серия КАК Серия
//			|ПОМЕСТИТЬ ВТ_Список
//			|ИЗ
//			|	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
//			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
//			|		ПО ПриобретениеТоваровУслуг.Ссылка = ПриобретениеТоваровУслугТовары.Ссылка
//			|ГДЕ
//			|	ПриобретениеТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
//			|	И ПриобретениеТоваровУслуг.Проведен
//			|	И ПриобретениеТоваровУслуг.Склад.ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач
//			|
//			|СГРУППИРОВАТЬ ПО
//			|	ПриобретениеТоваровУслуг.Ссылка,
//			|	ПриобретениеТоваровУслугТовары.Серия
//			|;
//			|
//			|////////////////////////////////////////////////////////////////////////////////
//			|ВЫБРАТЬ
//			|	ВТ_Список.Ссылка КАК Ссылка,
//			|	ВТ_Список.Серия КАК Серия
//			|ИЗ
//			|	ВТ_Список КАК ВТ_Список ";
//			//|ГДЕ
//			//|	ВТ_Список.Серия = &Серия";

//	
//		
//	ИначеЕсли ЗагрузитьСписаниеНаРасходы Тогда

//		Запрос.Текст = 
//			"ВЫБРАТЬ
//			|	ВнутреннееПотреблениеТоваров.Ссылка КАК Ссылка,
//			|	ВнутреннееПотреблениеТоваровТовары.Серия КАК Серия
//			|ПОМЕСТИТЬ ВТ_Список
//			|ИЗ
//			|	Документ.ВнутреннееПотреблениеТоваров КАК ВнутреннееПотреблениеТоваров
//			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВнутреннееПотреблениеТоваров.Товары КАК ВнутреннееПотреблениеТоваровТовары
//			|		ПО ВнутреннееПотреблениеТоваров.Ссылка = ВнутреннееПотреблениеТоваровТовары.Ссылка
//			|ГДЕ
//			|	ВнутреннееПотреблениеТоваров.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
//			|	И ВнутреннееПотреблениеТоваров.Проведен
//			|	И ВнутреннееПотреблениеТоваров.Склад.ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач
//			|
//			|СГРУППИРОВАТЬ ПО
//			|	ВнутреннееПотреблениеТоваров.Ссылка,
//			|	ВнутреннееПотреблениеТоваровТовары.Серия
//			|;
//			|
//			|////////////////////////////////////////////////////////////////////////////////
//			|ВЫБРАТЬ
//			|	ВТ_Список.Ссылка КАК Ссылка,
//			|	ВТ_Список.Серия КАК Серия
//			|ИЗ
//			|	ВТ_Список КАК ВТ_Список
//			|ГДЕ
//			|	ВТ_Список.Серия = &Серия";
//	
//		
//	ИначеЕсли ЗагрузитьОприходованиеИзлишковТоваров Тогда    

//		Запрос.Текст = 
//			"ВЫБРАТЬ
//			|	ОприходованиеИзлишковТоваров.Ссылка КАК Ссылка,
//			|	ОприходованиеИзлишковТоваровТовары.Серия КАК Серия
//			|ПОМЕСТИТЬ ВТ_Список
//			|ИЗ
//			|	Документ.ОприходованиеИзлишковТоваров КАК ОприходованиеИзлишковТоваров
//			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОприходованиеИзлишковТоваров.Товары КАК ОприходованиеИзлишковТоваровТовары
//			|		ПО ОприходованиеИзлишковТоваров.Ссылка = ОприходованиеИзлишковТоваровТовары.Ссылка
//			|ГДЕ
//			|	ОприходованиеИзлишковТоваров.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
//			|	И ОприходованиеИзлишковТоваров.Проведен
//			|	И ОприходованиеИзлишковТоваров.Склад.ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач
//			|
//			|СГРУППИРОВАТЬ ПО
//			|	ОприходованиеИзлишковТоваров.Ссылка,
//			|	ОприходованиеИзлишковТоваровТовары.Серия
//			|;
//			|
//			|////////////////////////////////////////////////////////////////////////////////
//			|ВЫБРАТЬ
//			|	ВТ_Список.Ссылка КАК Ссылка,
//			|	ВТ_Список.Серия КАК Серия
//			|ИЗ
//			|	ВТ_Список КАК ВТ_Список ";
//			//|ГДЕ
//			//|	ВТ_Список.Серия = &Серия";

//		
//		
//		
//		ИначеЕсли ЗагрузитьПередачаСырьяВПереработку Тогда    

//		Запрос.Текст = 
//			"ВЫБРАТЬ
//			|	ОприходованиеИзлишковТоваров.Ссылка КАК Ссылка,
//			|	ОприходованиеИзлишковТоваровТовары.Серия КАК Серия
//			|ПОМЕСТИТЬ ВТ_Список
//			|ИЗ
//			|	Документ.ОприходованиеИзлишковТоваров КАК ОприходованиеИзлишковТоваров
//			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОприходованиеИзлишковТоваров.Товары КАК ОприходованиеИзлишковТоваровТовары
//			|		ПО ОприходованиеИзлишковТоваров.Ссылка = ОприходованиеИзлишковТоваровТовары.Ссылка
//			|ГДЕ
//			|	ОприходованиеИзлишковТоваров.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
//			|	И ОприходованиеИзлишковТоваров.Проведен
//			|	И ОприходованиеИзлишковТоваров.Склад.ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач
//			|
//			|СГРУППИРОВАТЬ ПО
//			|	ОприходованиеИзлишковТоваров.Ссылка,
//			|	ОприходованиеИзлишковТоваровТовары.Серия
//			|;
//			|
//			|////////////////////////////////////////////////////////////////////////////////
//			|ВЫБРАТЬ
//			|	ВТ_Список.Ссылка КАК Ссылка,
//			|	ВТ_Список.Серия КАК Серия
//			|ИЗ
//			|	ВТ_Список КАК ВТ_Список
//			|ГДЕ
//			|	ВТ_Список.Серия = &Серия";
//	
//	КонецЕсли;
//	
//	
//	Запрос.УстановитьПараметр("Серия", Справочники.СерииНоменклатуры.ПустаяСсылка());
//	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(НачалоПериода));
//	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ОкончаниеПериода));
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		НоваяСтрока = СписокДокументов.Добавить();
//		НоваяСтрока.документ = ВыборкаДетальныеЗаписи.Ссылка;                                                      
//	КонецЦикла;
//	
//КонецПроцедуры


//&НаКлиенте
//Процедура Загрузить(Команда)
//	ЗагрузитьНаСервере();
//КонецПроцедуры

//&НаСервере
//Функция ЗагрузитьСоответствие()

//	Соответствие = Новый Соответствие();
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	СерииНоменклатуры.Ссылка КАК Ссылка,
//	|	СерииНоменклатуры.ВидНоменклатуры КАК ВидНоменклатуры
//	|ИЗ
//	|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
//	|ГДЕ
//	|	СерииНоменклатуры.Наименование = &Наименование";
//	
//	Запрос.УстановитьПараметр("Наименование", "Пустая серия");
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		Соответствие.Вставить(ВыборкаДетальныеЗаписи.ВидНоменклатуры, ВыборкаДетальныеЗаписи.Ссылка);
//	КонецЦикла;
//	
//	Возврат Соответствие;
//	
//КонецФункции


