

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Часов = Цел((Параметры.структураФактическоеВремяСборки-Дата(1,1,1))/60/60);
	Минут = (Параметры.структураФактическоеВремяСборки-Дата(1,1,1))/60 - Часов*60;
КонецПроцедуры

&НаКлиенте
Процедура МинутПриИзменении(Элемент)
	Если Минут>60 Тогда
		Минут = 0;
		ПоказатьПредупреждение(,"Формат ввода времени .. часов .. минут."+Символы.ПС+"Например 100 минут вводится как 1 час 40 минут.",30);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	ФактическоеВремяСборки = Новый Структура;
	ФактическоеВремяСборки.Вставить("Часов", Часов);
	ФактическоеВремяСборки.Вставить("Минут", Минут);
	Закрыть(ФактическоеВремяСборки);
КонецПроцедуры
