
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	ЗаполнениеСвойствПоСтатистикеСервер.ЗаполнитьСвойстваОбъекта(ЭтотОбъект, ДанныеЗаполнения);
	
	Если Не ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
	    Возврат;
	КонецЕсли; 	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.АктОтбора") Тогда
		// Заполнение шапки
		Комментарий = ДанныеЗаполнения.Комментарий;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		//
		Организация = ДанныеЗаполнения.Организация;
		ДатаНачалаИсследований = ТекущаяДатаСеанса();
		Для Каждого ТекСтрокаТЧ_Образцы Из ДанныеЗаполнения.ТЧ_Образцы Цикл
			НоваяСтрока = ТЧ_Образцы.Добавить();
			НоваяСтрока.ДокументПоступления = ДанныеЗаполнения.Ссылка;
			//НоваяСтрока.ЕдиницаИзмерения = ДанныеЗаполнения.ЕдиницаИзмерения;
			НоваяСтрока.КодПродукта = ТекСтрокаТЧ_Образцы.КодПродукта;
			НоваяСтрока.Номенклатура = ДанныеЗаполнения.Номенклатура;
			НоваяСтрока.Количество = ТекСтрокаТЧ_Образцы.Количество;
			НоваяСтрока.ИдентификаторСтрОбразцы = ТекСтрокаТЧ_Образцы.ИдентификаторСтрОбразцы;
			
		КонецЦикла;
		Для каждого лСтрокаТЧ_ВидыИсследований Из ДанныеЗаполнения.ТЧ_ВидыИсследований Цикл
			Если лСтрокаТЧ_ВидыИсследований.Лаборатория<>Лаборатория Тогда
			    Продолжить;
			КонецЕсли; 
			
			лНоваяСтрокаВИ = ТЧ_ВидыИсследований.Добавить();
			лНоваяСтрокаВИ.ИдентификаторСтрокиТЧОбразцы = лСтрокаТЧ_ВидыИсследований.ИдентификаторСтрокиТЧОбразцы;
			лНоваяСтрокаВИ.ВидИсследования = лСтрокаТЧ_ВидыИсследований.ВидИсследования;
			лНоваяСтрокаВИ.Образец = лСтрокаТЧ_ВидыИсследований.Образец;
			лНоваяСтрокаВИ.Количество = лСтрокаТЧ_ВидыИсследований.Количество;
			лНоваяСтрокаВИ.МассаОбразца = лСтрокаТЧ_ВидыИсследований.МассаОбразца;//0013643
			
		КонецЦикла; 
		
		//0019285
		Если НЕ ДанныеЗаполнения.Проведен И НЕ ДанныеЗаполнения.ПометкаУдаления Тогда
		   //проводим акти отбора, если он не проведен до сих пор
		   Попытка
			   ОснованиеОб = ДанныеЗаполнения.ПолучитьОбъект();
			   ОснованиеОб.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		   Исключение
		       Сообщить("Не удалось провести основание - документ "+ДанныеЗаполнения);
			   Сообщить(ОписаниеОшибки());
		   КонецПопытки; 
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Ошибка = "";
	
	Для Каждого ТекСтрокаТЧ_Образцы Из ТЧ_Образцы Цикл
		
		Для каждого лСтрокаТЧВидыИсследований Из ТЧ_ВидыИсследований Цикл
			Если лСтрокаТЧВидыИсследований.ИдентификаторСтрокиТЧОбразцы = ТекСтрокаТЧ_Образцы.ИдентификаторСтрОбразцы Тогда
				// регистр ОтборОбразцов Расход
				Движение = Движения.ОтборОбразцов.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				
				Движение.Номенклатура = ТекСтрокаТЧ_Образцы.Номенклатура;
				Движение.ВидДокумента = Перечисления.лаб_ВидыДокументов.АктОтбора;
				Движение.ВидИсследования = лСтрокаТЧВидыИсследований.ВидИсследования;
				Движение.Образец = лСтрокаТЧВидыИсследований.Образец;
				Движение.Лаборатория = Лаборатория;
				
				Движение.Количество = лСтрокаТЧВидыИсследований.Количество;
				
				// регистр ОтборОбразцов Приход
				Движение = Движения.ОтборОбразцов.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				
				Движение.Номенклатура = ТекСтрокаТЧ_Образцы.Номенклатура;
				Движение.ВидДокумента = Перечисления.лаб_ВидыДокументов.ПротоколАнализа;
				Движение.ВидИсследования = лСтрокаТЧВидыИсследований.ВидИсследования;
				Движение.Образец = лСтрокаТЧВидыИсследований.Образец;
				Движение.Лаборатория = Лаборатория;	
				
				Движение.Количество = лСтрокаТЧВидыИсследований.Количество;
			КонецЕсли; 
		КонецЦикла; 
	КонецЦикла;
	// записываем движения регистров
	//Движения.СтатусыОбразцов.Записать();
КонецПроцедуры
