
Функция ПечатьСЗ(Объект) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.СменноеЗадание.ПолучитьМакет("Печать1");
	// Заголовок
	Область = Макет.ПолучитьОбласть("Заголовок");
	ТабДок.Вывести(Область);
	// Шапка
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Шапка.Параметры.Заполнить(Объект);
	ТабДок.Вывести(Шапка);
	// Продукция
	Область = Макет.ПолучитьОбласть("ПродукцияШапка");
	ТабДок.Вывести(Область);
	
	ПовторятьПриПечатиСтроки = ТабДок.Область(ТабДок.ВысотаТаблицы-1, , ТабДок.ВысотаТаблицы,);
	ТабДок.ПовторятьПриПечатиСтроки = ПовторятьПриПечатиСтроки;

	ОбластьПродукция = Макет.ПолучитьОбласть("Продукция");
	
	Для Каждого ТекСтрокаПродукция Из Объект.Продукция Цикл
		ОбластьПродукция.Параметры.Заполнить(ТекСтрокаПродукция);
		
		ТабДок.Вывести(ОбластьПродукция);
	КонецЦикла;
	
	Пустая = Макет.ПолучитьОбласть("Пустая");
	Для Сч = 1 По 10  Цикл
	    ТабДок.Вывести(Пустая);
	КонецЦикла; 
	// Подвал
	
	Подвал = Макет.ПолучитьОбласть("Подвал");
	Подвал.Параметры.Заполнить(Объект);
	ТабДок.Вывести(Подвал);

	ТабДок.АвтоМасштаб = истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.ОтображатьЗаголовки = Ложь;
	Возврат ТабДок;
	
КонецФункции