
&НаКлиенте
Процедура Р1_пбт_НормативыПосле(Команда)
	
	//ПараметрыПереходаПоГиперссылке(ИмяЭлемента, Гиперссылка = "")
	Отбор = Новый Структура;
	Отбор.Вставить("Номенклатура", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	
	ПараметрыПереходаПоГиперссылке = Новый Структура;
	ПараметрыПереходаПоГиперссылке.Вставить("ИмяФормы", "РегистрСведений.НормативыНоменклатурыЛаб.ФормаСписка");
	ПараметрыПереходаПоГиперссылке.Вставить("ПараметрыФормы",ПараметрыФормы);
	ПараметрыПереходаПоГиперссылке.Вставить("РежимОткрытияОкнаФормы", РежимОткрытияОкнаФормы.Независимый);
	
	ГиперссылкаПерейтиСформироватьПараметрыИВопрос(ПараметрыПереходаПоГиперссылке);
	
КонецПроцедуры

Функция ДобавленныеРеквизиты()
	
	Массив = Новый Массив;
	Массив.Добавить("ВидыСырья");
	Массив.Добавить("НоменклатураДляОтчетов");
	Массив.Добавить("ТУ");
	Массив.Добавить("ДатаСоздания");
	Массив.Добавить("УпаковкаПродукта");
	Массив.Добавить("АгрегатноеСостояние");
	Массив.Добавить("Стерилизация");
	Массив.Добавить("СрокГодностиПослеВскрытияУпаковкиМес");
	
	Возврат Массив;
	
КонецФункции

&НаСервере
Процедура Р1_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	СписокДобавленныхРеквизитов = ДобавленныеРеквизиты();
	Для каждого Реквизит Из СписокДобавленныхРеквизитов Цикл
		ЭтотОбъект[Реквизит] = ЭтотОбъект.Объект[Реквизит];   
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура Р1_ПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СписокДобавленныхРеквизитов = ДобавленныеРеквизиты();
	Для каждого Реквизит Из СписокДобавленныхРеквизитов Цикл
		ТекущийОбъект[Реквизит] = ЭтотОбъект[Реквизит];   
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура СвернутьРазвернутьГруппуНажатиеПосле(Элемент)
	
	СвернутьРазвернутьГруппу(Элемент);
	
КонецПроцедуры

&НаСервере
&Вместо("ИменаСворачиваемыхГрупп")
Функция Р1_ИменаСворачиваемыхГрупп()

	ИменаСворачиваемыхГрупп = ПродолжитьВызов();
	ИменаСворачиваемыхГрупп.Добавить("ДопРеквизиты");
	Возврат ИменаСворачиваемыхГрупп;
	
КонецФункции
