&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуОтчет(Команда)
	
	//МенюОтчетыКлиент.ВыполнитьПодключаемуюКомандуОтчет(Команда, ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

		ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);

		Элементы.Партнер.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровИКонтрагентов");
		
		Если Объект.Ссылка.Пустая() ТОгда
			 Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		
КонецПроцедуры

 &НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ПриИзмененииКонтрагентаСервер();
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииКонтрагентаСервер()
	Объект.Партнер = Объект.Контрагент.Партнер;	
КонецПроцедуры	


&НаКлиенте
Процедура УказатьСерии(Команда)
	
	ОткрытьПодборСерийСырья();
	 
	//ПараметрыУказанияСерий = НоменклатураКлиентСервер.ПараметрыУказанияСерий();
	//ПараметрыУказанияСерий.ИспользоватьСерииНоменклатуры = Истина;
	//ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.вт_ПередачаСырьяВПереработку";
	//ПараметрыУказанияСерий.ИмяТЧТовары = "Товары";
	//
	//НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ЭтаФорма.Объект, ПараметрыУказанияСерий);
	//
	//мМассив = Новый Массив;
	//мМассив.Добавить("КлючСвязиСтроки");
	//ПараметрыУказанияСерий.ПоляСвязи = мМассив;	
	//
	//Если НоменклатураКлиент.ДляУказанияСерийНуженСерверныйВызов(ЭтаФорма, ПараметрыУказанияСерий, Текст, ТекущиеДанные)Тогда
	//	
	//	Если ТекущиеДанные = Неопределено Тогда
	//		ТекущиеДанныеИдентификатор = Элементы.ТаблицаСырье.ТекущиеДанные.ПолучитьИдентификатор();
	//	Иначе
	//		ТекущиеДанныеИдентификатор = ТекущиеДанные.ПолучитьИдентификатор();
	//	КонецЕсли;
	//	
	//	ПараметрыФормыУказанияСерий = НоменклатураСервер.ПараметрыФормыУказанияСерий(ЭтаФорма,,ТекущиеДанныеИдентификатор);		
	//	
	//	ЗначениеВозврата = Неопределено;
	//	
	//	ОткрытьФорму(ПараметрыФормыУказанияСерий.ИмяФормы, ПараметрыФормыУказанияСерий, ЭтаФорма,,,,
	//	
	//							Новый ОписаниеОповещения("ОткрытьПодборСерийСырьяЗавершение", ЭтотОбъект,
	//							
	//							Новый Структура("ПараметрыФормыУказанияСерий", ПараметрыФормыУказанияСерий)), 
	//							
	//							РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//	
	//КонецЕсли;
	//
	//
	////ОткрытьПодборСерийСырья(,,ПараметрыФормыУказанияСерий);
	
	
	
КонецПроцедуры


&НаСервере
Процедура ОткрытьПодборСерийСырья(Текст = "", ТекущиеДанные = Неопределено)
	
	//УказатьСерииНаСервере
	
	ПараметрыУказанияСерий = НоменклатураКлиентСервер.ПараметрыУказанияСерий();
	ПараметрыУказанияСерий.ИспользоватьСерииНоменклатуры = Истина;
	ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.вт_ПередачаСырьяВПереработку";
	ПараметрыУказанияСерий.ИмяТЧТовары = "Товары";
	//ПараметрыУказанияСерий.ИмяТЧСерии = "Серии";
	
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ЭтаФорма.Объект, ПараметрыУказанияСерий);
	
КонецПроцедуры

