
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
         Возврат;
    КонецЕсли;
	
	////brava 0014327 //проверка уникальности аналогов
	//ТЧ = АналогиСырья.Выгрузить();
	//СЗНом = Новый СписокЗначений;
	//Для каждого Стр Из АналогиСырья Цикл
	//	Стр.коэффициент = 1;
	//	СЗНом.Добавить(Стр.Аналог);
	//КонецЦикла; 
	//ТЧ.Свернуть("Аналог", "коэффициент");
	//
	//Для каждого Стр Из АналогиСырья Цикл
	//	Если Стр.коэффициент > 1 Тогда
	//		Сообщить("Вид сырья "+Ссылка+". Аналог "+ Стр.Аналог+" встречается в таблице "+Стр.коэффициент+" раз. Исправьте!");
	//		Отказ = Истина;
	//	КонецЕсли; 
	//КонецЦикла;
	//
	////85 brava Вида сырья. Если в качестве Аналога выбрна номенклатуры, которая уже является Аналогом в другом виде сырья, то сообщать об этом и не добавлять ее в текущий.
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//|	ВидыСырьяАналогиСырья.Ссылка,
	//|	ВидыСырьяАналогиСырья.Аналог
	//|ИЗ
	//|	Справочник.ВидыСырья.АналогиСырья КАК ВидыСырьяАналогиСырья
	//|ГДЕ
	//|	ВидыСырьяАналогиСырья.Аналог В(&Аналоги)
	//|	И ВидыСырьяАналогиСырья.Ссылка <> &Ссылка";
	//
	//Запрос.УстановитьПараметр("Аналоги", СЗНом);
	//Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//
	//Результат = Запрос.Выполнить();
	//Выборка = Результат.Выбрать();
	//
	//Пока Выборка.Следующий() Цикл
	//	Сообщить("При записи вида сырья "+Ссылка+" аналог "+Выборка.Аналог+" уже используется в виде сырья "+ Выборка.Ссылка);
	//    Отказ = Истина;
	//КонецЦикла;
	
КонецПроцедуры

//гг д инц 0018353
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
         Возврат;
    КонецЕсли;	
	
	//Запрос = Новый Запрос;
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	ИсторияИзмененияГруппыСнабженияВидовСырьяСрезПоследних.ГруппаСнабжения
	//|ИЗ
	//|	РегистрСведений.ИсторияИзмененияГруппыСнабженияВидовСырья.СрезПоследних(, ВидСырья = &ВидСырья) КАК ИсторияИзмененияГруппыСнабженияВидовСырьяСрезПоследних";
	//Запрос.УстановитьПараметр("ВидСырья", Ссылка);
	//Рез = Запрос.Выполнить().Выгрузить();
	//
	//БылаГруппаСнабжения = Неопределено;
	//Если Рез.Количество() > 0 Тогда
	//	БылаГруппаСнабжения = Рез[0].ГруппаСнабжения;
	//КонецЕсли;
	//
	//Если ГруппаСнабжения <> БылаГруппаСнабжения Тогда
	//	ЗаписьРегистра = РегистрыСведений.ИсторияИзмененияГруппыСнабженияВидовСырья.СоздатьМенеджерЗаписи();
	//	ЗаписьРегистра.Период = ТекущаяДатаСеанса();
	//	ЗаписьРегистра.ВидСырья = Ссылка;
	//	ЗаписьРегистра.ГруппаСнабжения = ГруппаСнабжения;
	//	ЗаписьРегистра.Записать();
	//КонецЕсли;
	
КонецПроцедуры
