
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//Ошибка = "";
	
	Для Каждого СтрВИ Из ЭтотОбъект.ТЧ_ВидыИсследований Цикл
		// регистр ОтборОбразцов Приход
		Движение = Движения.ОтборОбразцов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Номенклатура = ЭтотОбъект.Номенклатура;
		Движение.Период = Дата;
		Движение.ВидДокумента = Перечисления.лаб_ВидыДокументов.АктОтбора;
		Движение.ВидИсследования = СтрВИ.ВидИсследования;
		Движение.Лаборатория = СтрВИ.Лаборатория;
		Движение.Образец = СтрВИ.Образец;
		Движение.Количество = СтрВИ.Количество;
		
		//заполняем ссылку на этот документ в сам образец - потому что образцы создавались еще перед записью, чтобы их самих записать в тч
		Образец = СтрВИ.Образец;
		Если ЗначениеЗаполнено(Образец) Тогда
			Если НЕ Образец.ДокументПоступления = Ссылка Тогда
				ОбразецОб = Образец.ПолучитьОбъект();
				ОбразецОб.ДокументПоступления = Ссылка;
				
				ОбразецОб.Записать();
			КонецЕсли; 
		КонецЕсли; 
		
		//
		// регистр СтатусыОбразцов 
		//Движение = Движения.ОтборОбразцов.Добавить();
		//Движение.Период = ЭтотОбъект.Дата;
		//Движение.ДокументПоступления = ЭтотОбъект.Ссылка;
		//Движение.КодПродукта = ТекСтрокаТЧ_Образцы.КодПродукта;
		//Движение.Номенклатура = ЭтотОбъект.Номенклатура;
		//Движение.Организация = ЭтотОбъект.Организация;
		//Движение.Статус = Перечисления.лаб_СтатусыОбразца.ОтправленВЛабораторию;		//brava
	КонецЦикла;
	// записываем движения регистров
	Движения.ОтборОбразцов.Записать();
	//Движения.ОтборОбразцов.Записать();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СтрВИ = "";  //для краткого представления видов исследований
	Для каждого СтрТЧВИ Из ТЧ_ВидыИсследований Цикл
		СтрВИ = СтрВИ + Лев(СтрТЧВИ.ВидИсследования,1);
		
		Если СтрТЧВИ.Количество = 0 Тогда
			СтрТЧВИ.Количество = 1;
		КонецЕсли;
		Если СтрТЧВИ.МассаОбразца = 0 Тогда
			СтрТЧВИ.МассаОбразца = СтрТЧВИ.ВидИсследования.МассаОбразца;
		КонецЕсли;	   
	КонецЦикла; 
	
	ВИСтрокой = СтрВИ;
	
	Для каждого СтрТЧВИ Из ТЧ_ВидыИсследований Цикл
		//заполняем образцы
		СтрОбр = ТЧ_Образцы.Найти(СтрТЧВИ.ИдентификаторСтрокиТЧОбразцы, "ИдентификаторСтрОбразцы");
		Если НЕ СтрОбр = Неопределено Тогда
			Если ЗначениеЗаполнено(СтрТЧВИ.Образец) Тогда
				ОбразецОб = СтрТЧВИ.Образец.ПолучитьОбъект();
			Иначе	
				ОбразецОб = Справочники.ЛабораторныйОбразец.СоздатьЭлемент();
			КонецЕсли; 
			
			ОбразецОб.ВидИсследования = СтрТЧВИ.ВидИсследования;
			ОбразецОб.ДокументПоступления = Ссылка;
			ОбразецОб.КодПродукта = СтрОбр.КодПродукта;
			ОбразецОб.СерияНоменклатуры = СтрОбр.Серия;
			ОбразецОб.НомерЗамеса = СтрОбр.НомерЗамеса;
			ОбразецОб.Номенклатура = Номенклатура;
			ОбразецОб.Организация = Организация;
			ОбразецОб.МассаОбразца = СтрТЧВИ.МассаОбразца;
			ОбразецОб.ДатаИзготовления = СтрОбр.ДатаИзготовления;
			ОбразецОб.Наименование = Номенклатура;
			
			ОбразецОб.Записать();
			
			СтрТЧВИ.Образец = ОбразецОб.Ссылка;
			
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ЗаполнениеСвойствПоСтатистикеСервер.ЗаполнитьСвойстваОбъекта(ЭтотОбъект, ДанныеЗаполнения);
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	
КонецПроцедуры
