Функция СведенияОВнешнейОбработке() Экспорт

                РегистрационныеДанные = Новый Структура;

                РегистрационныеДанные.Вставить("Наименование", "Себестоимость товаров");

                РегистрационныеДанные.Вставить("БезопасныйРежим", Истина);

                РегистрационныеДанные.Вставить("Версия", "1.0");

               

                //ДополнительнаяОбработка

                //ДополнительныйОтчет

                //ЗаполнениеОбъекта

                //Отчет

                //ПечатанаяФорма

                //СозданиеСвязанныхОбъектов

                РегистрационныеДанные.Вставить("Вид", "ДополнительныйОтчет");
                РегистрационныеДанные.Вставить("Информация", "Себестоимость товаров");

               

                ///////////// команды /////////////////////////

                тзКоманд = Новый ТаблицаЗначений;

                тзКоманд.Колонки.Добавить("Идентификатор");

                тзКоманд.Колонки.Добавить("Представление");

                тзКоманд.Колонки.Добавить("Модификатор");

                тзКоманд.Колонки.Добавить("ПоказыватьОповещение");

                тзКоманд.Колонки.Добавить("Использование");

               

                строкаКоманды = тзКоманд.Добавить();

                строкаКоманды.Идентификатор = "1";

                строкаКоманды.Представление = "Себестоимость товаров (Открытие формы)";

                строкаКоманды.ПоказыватьОповещение = Истина;

                строкаКоманды.Использование = "ОткрытиеФормы";

               

                строкаКоманды = тзКоманд.Добавить();

                строкаКоманды.Идентификатор = "2";

                строкаКоманды.Представление = "Себестоимость товаров  (ВызовКлиентскогоМетода)";

                строкаКоманды.ПоказыватьОповещение = Истина;

                строкаКоманды.Использование = "ВызовКлиентскогоМетода";

               

                строкаКоманды = тзКоманд.Добавить();

                строкаКоманды.Идентификатор = "3";

                строкаКоманды.Представление = "Себестоимость товаров  (ВызовСерверногоМетода)";

                строкаКоманды.ПоказыватьОповещение = Истина;

                строкаКоманды.Использование = "ВызовСерверногоМетода";

               

                РегистрационныеДанные.Вставить("Команды", тзКоманд);

               

                ////////////// назначение (в каких объектах используется) /////////////////////////

                //для печ.форм, заполнения, ввода свазанных объектов

                //МассивНазначений = Новый Массив;

                //МассивНазначений.Добавить("Документ.*"); // все документы назначаются

                //МассивНазначений.Добавить("Документ.АвансовыйОтчет");

                //МассивНазначений.Добавить("Документ.ЗаказПокупателя");

                //РегистрационныеДанные.Вставить("Назначение", МассивНазначений);

               

                Возврат РегистрационныеДанные;

               

КонецФункции
