
&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	УстановитьОтборПоНоменклатуре();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоНоменклатуре()

	СписокН = Новый СписокЗначений;
	СписокН.Добавить(Номенклатура);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"Владелец",
		СписокН,
		ВидСравненияКомпоновкиДанных.ВСписке,
		,
		ЗначениеЗаполнено(Номенклатура));
		
	//ОбновитьГиперссылкуКОформлениюНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	УстановитьОтборПоСтатусу();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоСтатусу()

	СписокН = Новый СписокЗначений;
	СписокН.Добавить(Статус);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"Статус",
		СписокН,
		ВидСравненияКомпоновкиДанных.ВСписке,
		,
		ЗначениеЗаполнено(Статус));
		
	//ОбновитьГиперссылкуКОформлениюНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
	УстановитьОтборПоОтветственный();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоОтветственный()

	СписокН = Новый СписокЗначений;
	СписокН.Добавить(Ответственный);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"Ответственный",
		СписокН,
		ВидСравненияКомпоновкиДанных.ВСписке,
		,
		ЗначениеЗаполнено(Ответственный));
		
	//ОбновитьГиперссылкуКОформлениюНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") И ЗначениеЗаполнено(Параметры.Отбор.Владелец) Тогда
	    Номенклатура = Параметры.Отбор.Владелец;
		УстановитьОтборПоНоменклатуре();
	КонецЕсли; 
	
КонецПроцедуры



