
&Вместо("КомандыЗаказНаЭмиссиюКодовМаркировкиСУЗ")
Процедура Расш1_КомандыЗаказНаЭмиссиюКодовМаркировкиСУЗ(Команды)
	ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(
		Команды, "МаркировкаТоваровИСМП", НСтр("ru = 'Маркировка товаров ИС МП'"));
	ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(
		Команды, "ПеремаркировкаТоваровИСМП", НСтр("ru = 'Перемаркировка товаров ИС МП'"));
	ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(
		Команды, "ЗаказПоставщику", НСтр("ru = 'Заказ поставщику'"), "ИспользоватьЗаказыПоставщикам");
	//++	
	//ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(
	//	Команды, "вт_ОтчетПроизводства", НСтр("ru = 'Отчет производства'"));
	//ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(
	//	Команды, "вт_ЗаказВПроизводство", НСтр("ru = 'Заказ в производство'"));
	//--	
	Возврат;

КонецПроцедуры
