
&НаСервере
Процедура ЗаполнитьПродукциюНаСервере()
	
	Объект.Продукция.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	МаршрутныйЛист.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	Документ.МаршрутныйЛист КАК МаршрутныйЛист
	               |ГДЕ
	               |	МаршрутныйЛист.Дата МЕЖДУ &НачПериода И &КонПериода
	               |	И НЕ МаршрутныйЛист.ПометкаУдаления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номенклатура
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("НачПериода", НачалоДня(ДатаМаршрутных));
	Запрос.УстановитьПараметр("КонПериода", КонецДня(ДатаМаршрутных));	
	
	//Запрос.УстановитьПараметр("Организация", Организация);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НовСтр = Объект.Продукция.Добавить();
		НовСтр.Номенклатура = Выборка.Номенклатура;
		НовСтр.Исп = Ложь;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПродукцию(Команда)
	ЗаполнитьПродукциюНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВсе(Команда)
	
	ИзменитьВсеНаСервере(); 
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьВсеНаСервере()
	
	Для каждого Стр Из Объект.Продукция Цикл
		Стр.Исп = НЕ Стр.Исп;
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧНаСервере()
	
	Объект.ТЧ.Очистить();
	
	СЗНужнойНом = Новый СписокЗначений;
	Для каждого СтрПрод Из Объект.Продукция Цикл
		Если СтрПрод.Исп Тогда
			СЗНужнойНом.Добавить(СтрПрод.Номенклатура);
		КонецЕсли; 
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МаршрутныйЛистПродукция.Номенклатура КАК Номенклатура,
	               |	МаршрутныйЛистПродукция.Серия КАК Серия,
	               |	МаршрутныйЛистПродукция.НомерЗамеса КАК НомерСменыЗамеса,
	               |	МаршрутныйЛистВидыИсследований.ВидИсследований КАК ВидИсследований,
	               |	МаршрутныйЛистВидыИсследований.МассаОбразца КАК МассаОбразца,
	               |	МаршрутныйЛистПродукция.Ссылка.Линия КАК Линия,
	               |	МаршрутныйЛистПродукция.ХарактеристикаНоменклатуры КАК Характеристика,
	               |	МаршрутныйЛистПродукция.Ссылка.ДатаРеализации КАК СсылкаДатаРеализации,
	               |	МаршрутныйЛистВидыИсследований.Периодичность КАК Периодичность,
	               |	МаршрутныйЛистПродукция.Ссылка КАК МЛ
	               |ИЗ
	               |	Документ.МаршрутныйЛист КАК МаршрутныйЛистПродукция
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МаршрутныйЛист.ВидыИсследований КАК МаршрутныйЛистВидыИсследований
	               |		ПО МаршрутныйЛистПродукция.Ссылка = МаршрутныйЛистВидыИсследований.Ссылка
	               |ГДЕ
	               |	МаршрутныйЛистПродукция.Дата МЕЖДУ &НачПериода И &КонПериода
	               |	И НЕ МаршрутныйЛистПродукция.ПометкаУдаления
	               |	И МаршрутныйЛистПродукция.Номенклатура В(&Номенклатура)
	               |	И НЕ МаршрутныйЛистВидыИсследований.ВидИсследований В (&ВидИсследованийНеБрать)
	               |	И МаршрутныйЛистПродукция.Организация = &Организация
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	МаршрутныйЛистПродукция.Номенклатура,
	               |	МаршрутныйЛистПродукция.Серия,
	               |	МаршрутныйЛистПродукция.НомерЗамеса,
	               |	МаршрутныйЛистВидыИсследований.ВидИсследований,
	               |	МаршрутныйЛистВидыИсследований.МассаОбразца,
	               |	МаршрутныйЛистПродукция.Ссылка.Линия,
	               |	МаршрутныйЛистПродукция.ХарактеристикаНоменклатуры,
	               |	МаршрутныйЛистПродукция.Ссылка.ДатаРеализации,
	               |	МаршрутныйЛистВидыИсследований.Периодичность,
	               |	МаршрутныйЛистПродукция.Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Линия,
	               |	Номенклатура,
	               |	Серия,
	               |	НомерСменыЗамеса
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("НачПериода", НачалоДня(ДатаМаршрутных));
	Запрос.УстановитьПараметр("КонПериода", КонецДня(ДатаМаршрутных));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Номенклатура", СЗНужнойНом);
	ВидИсследованийНеБрать = Новый СписокЗначений;
	ВидИсследованийНеБрать.Добавить(Справочники.ВидыИсследований.ПредопределенныйЭлемент("Статистика"));
	Запрос.УстановитьПараметр("ВидИсследованийНеБрать", ВидИсследованийНеБрать);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НовСтрТЧ = Объект.ТЧ.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрТЧ, Выборка);
		НовСтрТЧ.Использовать = Истина;
		////инц  0005013 должны попадать еще и артикулы
		//ТекХар = Выборка.Характеристика; 
		//Если ЗначениеЗаполнено(ТекХар) Тогда
		//	Свойство = ФормированиеПечатныхФорм.ПолучитьСвойствоПоЗначениюХарактеристики(ТекХар);
		//	Если ЗначениеЗаполнено(Свойство) Тогда
		//		Если Свойство.Код = "ФизЛицо07" Тогда
		//			НовСтрТЧ.Комментарий = ""+ТекХар;
		//		КонецЕсли; 
		//	КонецЕсли; 
		//КонецЕсли;
		//
		////0021515
		Если Выборка.Периодичность = Перечисления.ПериодичностьЛаб.ППК Тогда
		    НовСтрТЧ.ППК = Истина;
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьТЧ(Команда)
	ЗаполнитьТЧНаСервере();
КонецПроцедуры


&НаСервере
Процедура СоздатьАктыОтбораНаСервере()
	
	ТекстОшибки = "";
	ТекНомерПартии = "";
	ТекНомерСменыЗамеса = "";
	
	Производитель = Справочники.Контрагенты.НайтиПоКоду("001014");
	
	Для каждого СТрТЧ Из ОБъект.ТЧ Цикл
		
		Если НЕ СТрТЧ.Использовать Тогда
			Продолжить;
		КонецЕсли; 
		
		//акт отбора
		Если (НЕ ТекНомерПартии = СТрТЧ.Серия) ИЛИ (НЕ ТекНомерСменыЗамеса = СТрТЧ.НомерСменыЗамеса) Тогда
			ТекНомерПартии = СТрТЧ.Серия;
			ТекНомерСменыЗамеса = СТрТЧ.НомерСменыЗамеса;
			
			ДокАктОтб = Документы.АктОтбора.СоздатьДокумент();
			ДокАктОтб.Дата = ТекущаяДатаСеанса();
			ДокАктОтб.ДатаСоздания = ТекущаяДатаСеанса();
			
			ДокАктОтб.Организация = Организация;
			ДокАктОтб.Пользователь = Пользователи.ТекущийПользователь();
			
			ДокАктОтб.Комментарий = СТрТЧ.Комментарий;
			ДокАктОтб.ППК = СТрТЧ.ППК;  
			
			НовСтрАкта = ДокАктОтб.ТЧ_Образцы.Добавить();
			
			НовСтрАкта.ДатаПоступленияНаСклад = ДокАктОтб.Дата;
			//НовСтрАкта.ЕдиницаИзмерения = ЕдИзмер;
			НовСтрАкта.Количество = 0;
			НовСтрАкта.ДокументОснование = СТрТЧ.МЛ;
			
			ДокАктОтб.Номенклатура = СТрТЧ.Номенклатура;
			НовСтрАкта.ДатаРеализации = СТрТЧ.ДатаРеализации;
			 
			НовСтрАкта.НомерЗамеса = СТрТЧ.НомерСменыЗамеса;
			НовСтрАкта.Серия = СТрТЧ.Серия;
			НовСтрАкта.ДатаИзготовления = ДатаМаршрутных;
			
			//НовСтрАкта.СрокГодности = ЛабораторияКлиент.ПолучитьСрокГодности(СТрТЧ.Номенклатура, ДатаМаршрутных);//ЛАБ_Номенклатура.срокГодности;
			//НовСтрАкта.Производитель = ЛАБ_Номенклатура.Производитель;
			НовСтрАкта.Производитель = Производитель;
			НовСтрАкта.ПометкаОбОтбореАрбитражногоОбразца = Истина;
			//НовСтрАкта.КодПродукта = 1;
			НовСтрАкта.ИдентификаторСтрОбразцы = Новый УникальныйИдентификатор;
		КонецЕсли;
		
		НовСтрВидИс = ДокАктОтб.ТЧ_ВидыИсследований.ДОбавить();
		НазвИсс = СокрЛП(СТрТЧ.ВидИсследований.Наименование);
		НовСтрВидИс.ВидИсследования = СТрТЧ.ВидИсследований;//Справочники.ВидыИсследований.НайтиПоНаименованию(НазвИсс, Истина);
		НовСтрВидИс.МассаОбразца = СТрТЧ.МассаОбразца;
		НовСтрВидИс.Количество = 1;
		НовСтрВидИс.Лаборатория = Лаборатория;
		НовСтрВидИс.ИдентификаторСтрокиТЧОбразцы = НовСтрАкта.ИдентификаторСтрОбразцы;
		НовСтрАкта.Количество = НовСтрАкта.Количество+1;
		
		Попытка
			ДокАктОтб.Записать();
			ТекстОшибки = ТекстОшибки +Символы.ПС+"Записан акт отбора "+ ДокАктОтб.Номер;
		Исключение
			ТекстОшибки = ТекстОшибки +Символы.ПС+ОписаниеОшибки();
			Продолжить;
		КонецПопытки;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	
КонецПроцедуры


&НаКлиенте
Процедура СоздатьАктыОтбора(Команда)
	СоздатьАктыОтбораНаСервере();
КонецПроцедуры

