Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр СтатусыОбразцов 
	//Движение = Движения.ОтборОбразцов.Добавить();
	//Движение.Период = Дата;
	//Движение.ДокументПоступления = ДокументПоступления;
	//Движение.КодПродукта = КодПродукта;
	//Движение.Номенклатура = Номенклатура;
	//Движение.Организация = Организация;
	//Движение.ВидИсследования = ВидИсследования;
	//Движение.Статус = Перечисления.лаб_СтатусыОбразца.ПолученПротоколАнализа;
	//Если  СтатусРезультатаИсследований = Перечисления.СтатусРезультатаИсследований.брак Тогда
	//	Движение.Статус = Перечисления.СтатусыОбразца.Брак;
	//КонецЕсли; 
	
	// регистр ОтборОбразцов Расход
	
	Движение = Движения.ОтборОбразцов.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	
	Движение.Номенклатура = Номенклатура;
	Движение.ВидДокумента = Перечисления.лаб_ВидыДокументов.ПротоколАнализа;
	Движение.ВидИсследования = ВидИсследования;
	Движение.Образец = Образец;
	Движение.Лаборатория = Лаборатория;	
	
	Движение.Количество = 1;
	
	
	// Подбор в талоны
	//лСтруктураДвижений = ЛабораторияКлиент.гл_СоздатьДвиженияПоОстаткамДляВыбора(Перечисления.ВидыДокументов.ЧекЛист, Дата, ЭтотОбъект, Перечисления.ВидыДокументов.ПротоколАнализа, Организация);	
	//Если НЕ лСтруктураДвижений = Неопределено Тогда 
	//	Движение = Движения.ОтборОбразцов.Добавить();
	//	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//	Движение.Период = Дата;
	//	Движение.Лаборатория = Лаборатория;
	//	
	//	Для Каждого лКлючИЗначение Из лСтруктураДвижений Цикл 
	//		Движение[лКлючИЗначение.Ключ] = лКлючИЗначение.Значение;	
	//	КонецЦикла;	
	//КонецЕсли;	
	//
	//// Подбор в УК
	//лСтруктураДвижений = ЛабораторияКлиент.гл_СоздатьДвиженияПоОстаткамДляВыбора(Перечисления.ВидыДокументов.УдостоверениеКачества, Дата, ЭтотОбъект, Перечисления.ВидыДокументов.ПротоколАнализа, Организация);	
	//Если НЕ лСтруктураДвижений = Неопределено Тогда 
	//	Движение = Движения.ОтборОбразцов.Добавить();
	//	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//	Движение.Период = Дата;
	//	Движение.МестоХранения = МестоХранения;
	//	
	//	Для Каждого лКлючИЗначение Из лСтруктураДвижений Цикл 
	//		Движение[лКлючИЗначение.Ключ] = лКлючИЗначение.Значение;	
	//	КонецЦикла;	
	//КонецЕсли;	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ВИСтрокой = Лев(ВидИсследования,1);
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ЗаполнениеСвойствПоСтатистикеСервер.ЗаполнитьСвойстваОбъекта(ЭтотОбъект, ДанныеЗаполнения);
КонецПроцедуры
