
&НаСервере
Функция ПечатьСЗНаСервере()
	Возврат Документы.СменноеЗадание.ПечатьСЗ(Объект);
КонецФункции

&НаКлиенте
Процедура ПечатьСЗ(Команда)
	ТабДок = ПечатьСЗНаСервере();
	ТабДок.Показать();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоРазбивкеНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Возврат;
	КонецЕсли; 
	
	Основание = Объект.ДокументОснование;
	
	Если НЕ ЗначениеЗаполнено(Объект.Дата) Тогда
		Объект.Дата = ТекущаяДатаСеанса();
	КонецЕсли; 
	
	Организация = Основание.Организация;
	Объект.Продукция.Очистить();
	
	Комментарий = Основание.Комментарий; 
	ИмяРеквизита = "Колич"+ДеньНедели(Объект.Дата); 
	Если Основание.Метаданные().ТабличныеЧасти.Продукция.Реквизиты.Найти(ИмяРеквизита) = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Надо выбрать рабочий день!");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли; 
	
	Для каждого Стр Из Основание.Продукция Цикл
		Если ЗначениеЗаполнено(Стр[ИмяРеквизита]) Тогда
			НовСтр = Объект.Продукция.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Стр);
			НовСтр.КоличествоПлановое = Стр[ИмяРеквизита];
			НовСтр.Рецепт = Стр.Рецепт; //РасчетРецептур.ПолучитьТекущийРецепт(НовСтр.Номенклатура, НовСтр.ХарактеристикаНоменклатуры);  
			НовСтр.Линия = Стр.Линия;
			НовСтр.ОбъемЗамеса = Стр.Линия.Мощность;
			НовСтр.Примечание = Стр.КомментарийСтр;
			
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоРазбивке(Команда)
	
	ЗаполнитьПоРазбивкеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПродукцияЛинияПриИзмененииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияЛинияПриИзменении(Элемент)
	ПродукцияЛинияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
КонецПроцедуры
