
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьТаблицуОбразцов();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуОбразцов()
	лРезультат = Лаборатория_Сервер.гл_ПолучитьОбщуюТаблицуОбразцов(Отчет.Период.ДатаНачала, Отчет.Период.ДатаОкончания, Отчет.Лаборатория);	
	Отчет.ТабличноеПолеОбразцы.Загрузить(лРезультат.Выгрузить());
КонецПроцедуры	


&НаСервере
Процедура ТабличноеПолеОбразцыПриАктивизацииСтрокиНаСервере(ПараметрыСтроки)
	
	лРезультат = Лаборатория_Сервер.гл_ПолучитьДокументыПоОбразцу(ПараметрыСтроки.Номенклатура, ПараметрыСтроки.КодПродукта, ПараметрыСтроки.ДокументПоступления);
	Отчет.ТабличноеПолеДокументы.Загрузить(лРезультат.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличноеПолеОбразцыПриАктивизацииСтроки(Элемент)
	
	ОбновитьТаблицуДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличноеПолеДокументыВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	СтандартнаяОбработка = Истина;
	ТекДанные = Элементы.ТабличноеПолеДокументы.ТекущиеДанные;
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ЗаполнитьТаблицуОбразцов();
КонецПроцедуры

&НаКлиенте
Процедура ЛабораторияПриИзменении(Элемент)
	ЗаполнитьТаблицуОбразцов();
КонецПроцедуры

&НаСервере
Процедура СоздатьУКНаСервере()
	
	Для каждого СтрТЗ Из Отчет.ТабличноеПолеДокументы Цикл
		
		Если ТипЗнч(СтрТЗ.Документ) = Тип("ДокументСсылка.ПротоколАнализа") Тогда
			
			//Если СтрТЗ.Документ.ВидИсследования<>Справочники.ВидыИсследований.Органолептика Тогда
			//	Продолжить;
			//КонецЕсли;
			
			Протокол = СтрТЗ.Документ;
			ТекНом = Протокол.Номенклатура;
			
			//находим сертификат
			ВыбДекл = Лаборатория_Сервер.ПолучитьРазрешительныеДокументыНаНом(ТекНом, ТекущаяДатаСеанса());
			Если НЕ ЗначениеЗаполнено(ВыбДекл) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для номенклатуры "+ТекНом+" не найден действующий сертификат");
			КонецЕсли;   
			
			//
			ДокУК = Документы.УдостоверениеКачества.СоздатьДокумент();
			СтандартнаяОбработка = Истина;
			ДокУК.Заполнить(Протокол);
			ДокУК.Дата = ТекущаяДатаСеанса();
			
			ДокУК.Пользователь = Пользователи.ТекущийПользователь();
			
			Попытка
				ДокУК.Записать();
				ДокУК.Записать(РежимЗаписиДокумента.Проведение)
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки; 
			
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьУК(Команда)
	СоздатьУКНаСервере();
	ОбновитьТаблицуДокументов();
КонецПроцедуры

&НаКлиенте
Процедура ТабличноеПолеДокументыПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	ОткрытьЗначение(Элемент.ТекущиеДанные.Документ);
	//Док = Элемент.ТекущиеДанные.Документ;
	//ФормаДока = Док.ПолучитьФорму();
	//ФормаДока.Открыть();
	//ВидДокумента = Док.Метаданные().Имя;
	//П = Новый Структура;
	//П.Вставить("Ключ", Док);
	//ОткрытьФорму("Документ."+ВидДокумента+".ФормаДокумента", П);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицуДокументов()
	
	ТекДанные = Элементы.ТабличноеПолеОбразцы.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда
		
		ПараметрыСтроки = Новый Структура;
		ПараметрыСтроки.Вставить("Номенклатура", ТекДанные.Номенклатура);
		ПараметрыСтроки.Вставить("КодПродукта", ТекДанные.КодПродукта);
		ПараметрыСтроки.Вставить("ДокументПоступления", ТекДанные.ДокументПоступления);
		ТабличноеПолеОбразцыПриАктивизацииСтрокиНаСервере(ПараметрыСтроки);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ЗаполнитьТаблицуОбразцов();
КонецПроцедуры


