Процедура ЗаполнениеТаблиц(Объект) Экспорт
	
	//заполняем данными из протоколов
	Запрос = Новый Запрос;
	Запрос.Текст = 	
	"ВЫБРАТЬ
	|	ПротоколАнализаТЧ_Показатели.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ПротоколАнализаТЧ_Показатели.Значение КАК Значение,
	|	ПротоколАнализаТЧ_Показатели.Показатель КАК Показатель,
	|	ПротоколАнализаТЧ_Показатели.ЗначениеПоТУ КАК ЗначениеПоТУ,
	|	ПротоколАнализаТЧ_Показатели.ВариантСравнения КАК ВариантСравнения,
	|	ПротоколАнализаТЧ_Показатели.Интервал КАК Интервал,
	|	ПротоколАнализаТЧ_Показатели.Погрешность КАК Погрешность,
	|	ПротоколАнализаТЧ_Показатели.Ссылка.ВидИсследования КАК ВидИсследования
	|ИЗ
	|	Документ.ПротоколАнализа.ТЧ_Показатели КАК ПротоколАнализаТЧ_Показатели
	|ГДЕ
	|	ПротоколАнализаТЧ_Показатели.Ссылка.Номенклатура = &Номенклатура
	|	И ПротоколАнализаТЧ_Показатели.Ссылка.Серия = &Серия" ;
	
	Запрос.УстановитьПараметр("Номенклатура", Объект.Номенклатура);
	Запрос.УстановитьПараметр("Серия", Объект.Серия);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НовСтр = Объект.ТЧ_Показатели.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
	КонецЦикла;
	
КонецПроцедуры