Функция СведенияОВнешнейОбработке() Экспорт

//ОбъектыНазначенияФормы = Новый Массив;
//ОбъектыНазначенияФормы.Добавить("Документ.РеализацияТоваровУслуг");
//ОбъектыНазначенияФормы.Добавить("Документ.ПоступлениеТоваров");

ПараметрыРегистрации = Новый Структура;
ПараметрыРегистрации.Вставить("Вид", "ДополнительнаяОбработка");
ПараметрыРегистрации.Вставить("БезопасныйРежим", Истина);
//ПараметрыРегистрации.Вставить("Назначение", ОбъектыНазначенияФормы);
ПараметрыРегистрации.Вставить("Версия", "1.0");
//Если Не ЗначениеЗаполнено(НаименованиеОбработки) Тогда
//НаименованиеОбработки = ЭтотОбъект.Метаданные().Представление();
//КонецЕсли;
ПараметрыРегистрации.Вставить("Наименование", "Журнал производства заказов дерево");

//Если Не ЗначениеЗаполнено(Информация) Тогда
Информация = ЭтотОбъект.Метаданные().Комментарий;
//КонецЕсли;
ПараметрыРегистрации.Вставить("Информация", Информация);


ТаблицаКоманд = ПолучитьТаблицуКоманд();

ДобавитьКоманду(ТаблицаКоманд,
"Отбор заказов", // Представление команды в пользовательском интерфейсе
"ОткрытьОбработку", // Уникальный идентификатор команды
"ОткрытиеФормы", // Использование команды //ОткрытиеФормы
//Истина, // Показывать оповещение.
);

ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);

Возврат ПараметрыРегистрации;

КонецФункции

Функция ПолучитьТаблицуКоманд()

Команды = Новый ТаблицаЗначений;
Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
Возврат Команды;

КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
// Добавляем команду в таблицу команд по переданному описанию.
// Параметры и их значения можно посмотреть в функции ПолучитьТаблицуКоманд
НоваяКоманда = ТаблицаКоманд.Добавить();
НоваяКоманда.Представление = Представление;
НоваяКоманда.Идентификатор = Идентификатор;
НоваяКоманда.Использование = Использование;
НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
НоваяКоманда.Модификатор = Модификатор;

КонецПроцедуры