
&НаСервере
Функция ПечатьРДНаСервере()
	Возврат Документы.РазбивкаПоДням.ПечатьРД(Объект);
КонецФункции

&НаКлиенте
Процедура ПечатьРД(Команда)
	ТабДок = ПечатьРДНаСервере();
	ТабДок.Показать();
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияКолич1ПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Продукция.ТекущиеДанные;
	ПересчетСтрокиНаКлиенте(ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ПересчетСтрокиНаКлиенте(ТекущаяСтрока)
	ТекущаяСтрока.Итого = ТекущаяСтрока.Колич1+ТекущаяСтрока.Колич2+ТекущаяСтрока.Колич3+ТекущаяСтрока.Колич4+ТекущаяСтрока.Колич5;
	ТекущаяСтрока.Разница = ТекущаяСтрока.Итого-ТекущаяСтрока.Количество;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоЗаказуНаПеремещениеНаСервере()
	
	Объект.Продукция.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	вт_ЗаказВПроизводство.Номенклатура КАК Номенклатура,
	               |	вт_ЗаказВПроизводство.Количество КАК Количество,
	               |	вт_ЗаказВПроизводство.КоличествоУпаковок КАК КоличествоУпаковок,
	               |	вт_ЗаказВПроизводство.ВариантПроизводства КАК Рецепт
	               |ИЗ
	               |	Документ.вт_ЗаказВПроизводство.Товары КАК вт_ЗаказВПроизводство
	               |ГДЕ
	               |	вт_ЗаказВПроизводство.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Заказ);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НовСтр = Объект.Продукция.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
		
		НовСтр.Разница = НовСтр.Количество;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоЗаказуНаПеремещение(Команда)
	ЗаполнитьПоЗаказуНаПеремещениеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаказНаПеремещениеПриИзменении(Элемент)
	ЗаполнитьПоЗаказуНаПеремещениеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;

КонецПроцедуры
