&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
		
	Форма = ПолучитьФорму("Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Форма.ФормаДокумента");
	ДанныеФормы = Форма.Объект;
	ЗаполнитьДокументНаСервере(ДанныеФормы,ПараметрКоманды);
	КопироватьДанныеФормы(ДанныеФормы, Форма.Объект);
	Форма.Открыть();
		
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьДокументНаСервере(ДанныеЗаполнения,ПараметрКоманды)
	
	Док = ДанныеФормыВЗначение(ДанныеЗаполнения, Тип("ДокументОбъект.ЗаказНаЭмиссиюКодовМаркировкиСУЗ"));
	ПараметрыОткрытия = ПараметрыОткрытияФормы(ПараметрКоманды);
	Док.Заполнить(ПараметрыОткрытия);
	ЗначениеВДанныеФормы(Док,ДанныеЗаполнения);
	
КонецПроцедуры	

&НаСервере
Функция ПараметрыОткрытияФормы(ПараметрКоманды)
	
	ПараметрыОснования = Новый Структура;
	ПараметрыОснования.Вставить("ЗначенияЗаполнения", ПараметрКоманды);
	ПараметрыОснования.Вставить("ОтчетПроизводства",Истина);	
	
	Возврат ПараметрыОснования;
	
КонецФункции

