
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПоСебестоимости = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПоСебестоимостиПриИзменении(Элемент)
	Если ПоСебестоимости Тогда  		
		ЭтаФорма.Элементы.ПоСебестоимости.Видимость = Истина;
		ЭтаФорма.Элементы.ПоВидуЦен.Видимость = Ложь;
		ОчиститьПоВидуЦен();
	Иначе
		ЭтаФорма.Элементы.ПоВидуЦен.Видимость = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	ВозвращаемыеДанные = ВозвратСтруктурыВыбораСебестоимости();
	Если Не ПоСебестоимости И ЗначениеЗаполнено(ПоВидуЦен) Тогда
		ЭтаФорма.Закрыть(ВозвращаемыеДанные);
	ИначеЕсли ПоСебестоимости Тогда
		ЭтаФорма.Закрыть(ВозвращаемыеДанные);
	Иначе
		Сообщить("Или выберите по себестоимости, или заполните Вид цен");
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ВозвратСтруктурыВыбораСебестоимости()
	Возврат Новый Структура("ПоСебестоимости,ПоВидуЦен",ПоСебестоимости, ПоВидуЦен.Ссылка);
КонецФункции

&НаСервере
Процедура ОчиститьПоВидуЦен() 		
	ПоВидуЦен = Справочники.ВидыЦен.ПустаяСсылка();
КонецПроцедуры	