Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) 
 	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.вт_ЗаказВПроизводство") Тогда
		 ЭтотОбъект.ДокументОснования = ДанныеЗаполнения;
		 ЭтотОбъект.Склад = КонстантыСервер.ПолучитьЗначениеКонстанты("вт_СкладПроизводства");
		 ЭтотОбъект.ДокументОснования = ДанныеЗаполнения;
		 //Заполняем план сборки из заказ производства
		ЭтотОбъект.Организация = ДанныеЗаполнения.Организация; 
		Для Каждого СтрокаЗаказа из ДанныеЗаполнения.ТОвары Цикл
			пВариантКомплектации = ОсновнойВариантКомплектации(СтрокаЗаказа.Номенклатура);
			Если пВариантКомплектации.Пустая()  Тогда
				Продолжить;
			КонецЕсли;
		 НовСтрока = ЭтотОбъект.Товары.Добавить();
		 НовСтрока.Номенклатура = СтрокаЗаказа.Номенклатура;
		 НовСтрока.Количество = СтрокаЗаказа.Количество;
		 НовСтрока.ВариантКомплектации = пВариантКомплектации; 
		 
		 ЗагрузитьВложенныеЭлементыКомплекта(НовСтрока.Номенклатура, НовСтрока.Количество, НовСтрока.ВариантКомплектации);
		 
	 	КонецЦикла;
	    ОбновитьТекущиеОстаткиПоПлануГотовойПродукции();
		
   КонецЕсли;
КонецПроцедуры	

Процедура ЗагрузитьВложенныеЭлементыКомплекта(пНоменклатура, пКоличество, пВариантКомплектации)

	Для Каждого СтрокаСостава из пВариантКомплектации.Товары Цикл
				НовСтрокаКомпл = ЭтотОбъект.Комплектующие.Добавить();
				
				НовСтрокаКомпл.ВариантКомплектации = пВариантКомплектации;
				НовСтрокаКомпл.ГотоваяПродукция = пНоменклатура;
				НовСтрокаКомпл.Номенклатура = СтрокаСостава.Номенклатура;
				НовСтрокаКомпл.Количество = пКоличество * СтрокаСостава.Количество;
				
				пВариант = ОсновнойВариантКомплектации(СтрокаСостава.Номенклатура);
			
				Если пВариант.Пустая()  Тогда //Значит это конечное изделие
					
				Иначе //Это тоже нужно собирать	
					НовСтрокаТовара = ЭтотОбъект.Товары.Добавить();
					НовСтрокаТовара.Номенклатура =  СтрокаСостава.Номенклатура;
					НовСтрокаТовара.Количество = НовСтрокаКомпл.Количество;
					НовСтрокаТовара.ВариантКомплектации = пВариант;
					
					ЗагрузитьВложенныеЭлементыКомплекта(НовСтрокаТовара.Номенклатура, НовСтрокаТовара.Количество, НовСтрокаТовара.ВариантКомплектации);
				КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры	


Процедура ОбновитьТекущиеОстаткиПоПлануГотовойПродукции()
	//По таблице Товары определить текущие остатки и скорректировать план в производство
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВТ_ПлановыеТовары.Номенклатура
	                      |ПОМЕСТИТЬ ВТ_ПЛАНОВЫЕ
	                      |ИЗ
	                      |	&ВТ_ПлановыеТовары КАК ВТ_ПлановыеТовары
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_ПЛАНОВЫЕ.Номенклатура,
	                      |	естьnull(ТоварыОрганизацийОстатки.КоличествоОстаток,0) КАК КоличествоОстаток,
	                      |	естьnull(ТоварыНаСкладахОстатки.ВНаличииОстаток,0) КАК ВНаличииОстаток
	                      |ИЗ
	                      |	ВТ_ПЛАНОВЫЕ КАК ВТ_ПЛАНОВЫЕ
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций.Остатки(&ГраницаОстатка, Организация = &Организация) КАК ТоварыОрганизацийОстатки
	                      |		ПО ВТ_ПЛАНОВЫЕ.Номенклатура = ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Номенклатура
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(&ГраницаОстатка, Склад В (&Склады)) КАК ТоварыНаСкладахОстатки
	                      |		ПО ВТ_ПЛАНОВЫЕ.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура");	
	МассивСклады = Новый Массив;
	МассивСклады.Добавить(ЭтотОбъект.Склад);
	
	Запрос.УстановитьПараметр("ГраницаОстатка",Новый МоментВремени(ТекущаяДата()));
	Запрос.УстановитьПараметр("ВТ_ПлановыеТовары", ЭтотОбъект.Товары);
	Запрос.УстановитьПараметр("Склады",МассивСклады);
	Запрос.УстановитьПараметр("Организация",ЭтотОбъект.Организация);
	
	ТаблОстатки = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаПлана из ЭтотОбъект.Товары ЦИкл
		   ОтборСтрок = Новый Структура("Номенклатура",СтрокаПлана.Номенклатура);
		   НайденыСтроки = ТаблОстатки.НайтиСтроки(ОтборСтрок);
		   СтрокаПлана.ТекущийОстаток = 0;
		   Если НайденыСтроки.Количество()>0 Тогда
			   СтрокаПлана.ТекущийОстаток = ?(НайденыСтроки[0].КоличествоОстаток>0,НайденыСтроки[0].КоличествоОстаток, НайденыСтроки[0].ВНаличииОстаток);
		   КонецЕсли;
		   
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Функция ОсновнойВариантКомплектации(пНоменклатура) Экспорт
	РезультатОтвета = Справочники.ВариантыКомплектацииНоменклатуры.ПустаяСсылка();
	ВыборкаВариантов = Справочники.ВариантыКомплектацииНоменклатуры.Выбрать(,пНоменклатура);
	Пока ВыборкаВариантов.Следующий() Цикл
		Если ВыборкаВариантов.Основной И НЕ ВыборкаВариантов.ПометкаУдаления Тогда
			РезультатОтвета = ВыборкаВариантов.Ссылка;
		КонецЕсли;	
	КонецЦикла;
	 
	Возврат РезультатОтвета;
КонецФункции


Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	ЗаписатьПланСборки();
КонецПроцедуры	

Процедура ЗаписатьПланСборки()
 	Движения.вт_ПланСборкиТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.вт_ПланСборкиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ЗаказПроизводства = ДокументОснования;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;
	 
КонецПроцедуры