&Вместо("ЗаполнитьЭтапыГрафикаОплаты")
Процедура ПБТ_ЗаполнитьЭтапыГрафикаОплаты() Экспорт
	
	ЭтапыГрафикаОплаты.Очистить();
	
	СуммаДокумента   = ПолучитьСуммуДокумента();
	СуммаТары        = ПолучитьСуммуДокументаПоТаре();
	
	Если СуммаДокумента + СуммаТары > 0 Тогда
		
		ЖелаемаяДата = КредитныйКонтроль.ПолучитьДатуПлатежаПоДатеДокумента(Дата, Договор);
		
		ПараметрыДляДобавления = ЭтапыОплатыКлиентСервер.ПараметрыДляДобавленияЭтапаПоУмолчанию();
		ПараметрыДляДобавления.Объект = ЭтотОбъект;
		Если ЖелаемаяДата<>Дата Тогда
		    ПараметрыДляДобавления.ВариантОплаты = Перечисления.ВариантыОплатыКлиентом.КредитПослеОтгрузки;
		Иначе	
		    ПараметрыДляДобавления.ВариантОплаты = Перечисления.ВариантыОплатыКлиентом.ПредоплатаДоОтгрузки;
		КонецЕсли; 
		
		ПараметрыДляДобавления.ЖелаемаяДата = ЖелаемаяДата;
		ПараметрыДляДобавления.ДатаСеанса = ТекущаяДатаСеанса();
		ПараметрыДляДобавления.СуммаОплатыПоДокументу = СуммаДокумента - СуммаТары;
		ПараметрыДляДобавления.СуммаЗалогаПоДокументу = СуммаТары;
		
		ЭтапыОплатыКлиентСервер.ДобавитьЭтапОплатыПоУмолчанию(ПараметрыДляДобавления);
		
		ЭтапыОплатыСервер.ЗаполнитьПроцентыПоСуммам(Новый Структура("ЭтапыГрафикаОплаты,ЕстьТара", ЭтотОбъект.ЭтапыГрафикаОплаты,СуммаТары > 0));
		
	КонецЕсли;
	
КонецПроцедуры