
&НаКлиенте
Процедура Р1_ДоговорНачалоВыбораПосле(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НовыеПараметры = "";
	
	НовыеПарметры(Элемент.ПараметрыВыбора, НовыеПараметры);

	Элемент.ПараметрыВыбора = НовыеПараметры;

КонецПроцедуры


&НаСервере
Процедура НовыеПарметры(ПараметрыВыбора, НовыеПараметры)
	
	НовыйПараметрыВыбора = Новый Массив(ПараметрыВыбора);
	
	ПараметрыВыбораОрганизация = Новый ПараметрВыбора("Отбор.Организация", Объект.Организация);

	НовыйПараметрыВыбора.Добавить(ПараметрыВыбораОрганизация);
	

	НовыеПараметры = Новый ФиксированныйМассив(НовыйПараметрыВыбора);

КонецПроцедуры



&НаКлиенте
Процедура Р1_ДоговорНачалоВыбораИзСпискаПосле(Элемент, СтандартнаяОбработка)

	
	
КонецПроцедуры
