
&НаСервере
Процедура ГруппаДляПоказателейВТУПриИзмененииНаСервере()
	Документы.НастройкаЗначенийПоказателей.ЗаполнитьНоменклатуру(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ГруппаДляПоказателейВТУПриИзменении(Элемент)
	ГруппаДляПоказателейВТУПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТЧ_ПоказателиПоказательПриИзмененииНаСервере(Идент)
	
	Данные = Объект.ТЧ_Показатели.НайтиПоИдентификатору(Идент);
	
	Если ЗначениеЗаполнено(Данные.Показатель) Тогда
		//Данные.ВидИсследования = Данные.Показатель.ВидИсследования;
		Данные.ЕдиницаИзмерения = Данные.Показатель.ЕдиницаИзмерения;
		Данные.Значение = Данные.Показатель.ТипЗначения.ПривестиЗначение(Данные.Значение);
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ТЧ_ПоказателиПоказательПриИзменении(Элемент)
	ТекСтр = Элементы.ТЧ_Показатели.ТекущаяСтрока;
	ТЧ_ПоказателиПоказательПриИзмененииНаСервере(ТекСтр);
КонецПроцедуры

