
&Вместо("ЗаполнитьДанныеВыбораУпаковками")
Процедура Расш1_ЗаполнитьДанныеВыбораУпаковками(Номенклатура, ДанныеВыбора, СтрокаПоиска, Знач ПоказыватьМерныеЕдиницыИзмерения, ДобавлятьЕдиницуХранения, ПоказыватьТоварныеМеста)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	УпаковкиНоменклатуры.Ссылка КАК Ссылка,
	|	УпаковкиНоменклатуры.ПометкаУдаления КАК ПометкаУдаления,
	|	УпаковкиНоменклатуры.Наименование КАК Наименование,
	|	ЛОЖЬ КАК ЭтоЕдиницаХранения,
	|	3 КАК Порядок,
	|	&ТекстЗапросаКоэффициентУпаковки КАК Коэффициент,
	|	&ТекстЗапросаДоступностьКоэффициентУпаковки КАК ДопустимыйКоэффициент
	|ПОМЕСТИТЬ УпаковкиЕдиницыИзмерения
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиНоменклатуры
	|		ПО (Номенклатура.ВесИспользовать)
	|			И (Номенклатура.ВесМожноУказыватьВДокументах)
	|			И (УпаковкиНоменклатуры.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес))
	|ГДЕ
	|	Номенклатура.Ссылка = &Номенклатура
	|	И (&ПоказыватьМерныеЕдиницыИзмерения
	|			ИЛИ Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УпаковкиНоменклатуры.Ссылка,
	|	УпаковкиНоменклатуры.ПометкаУдаления,
	|	УпаковкиНоменклатуры.Наименование,
	|	ЛОЖЬ,
	|	4,
	|	&ТекстЗапросаКоэффициентУпаковки,
	|	&ТекстЗапросаДоступностьКоэффициентУпаковки
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиНоменклатуры
	|		ПО (Номенклатура.ОбъемИспользовать)
	|			И (Номенклатура.ОбъемМожноУказыватьВДокументах)
	|			И (УпаковкиНоменклатуры.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Объем))
	|ГДЕ
	|	Номенклатура.Ссылка = &Номенклатура
	|	И (&ПоказыватьМерныеЕдиницыИзмерения
	|			ИЛИ Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Объем))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УпаковкиНоменклатуры.Ссылка,
	|	УпаковкиНоменклатуры.ПометкаУдаления,
	|	УпаковкиНоменклатуры.Наименование,
	|	ЛОЖЬ,
	|	5,
	|	&ТекстЗапросаКоэффициентУпаковки,
	|	&ТекстЗапросаДоступностьКоэффициентУпаковки
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиНоменклатуры
	|		ПО (Номенклатура.ДлинаИспользовать)
	|			И (Номенклатура.ДлинаМожноУказыватьВДокументах)
	|			И (УпаковкиНоменклатуры.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Длина))
	|ГДЕ
	|	Номенклатура.Ссылка = &Номенклатура
	|	И (&ПоказыватьМерныеЕдиницыИзмерения
	|			ИЛИ Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Длина))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УпаковкиНоменклатуры.Ссылка,
	|	УпаковкиНоменклатуры.ПометкаУдаления,
	|	УпаковкиНоменклатуры.Наименование,
	|	ЛОЖЬ,
	|	6,
	|	&ТекстЗапросаКоэффициентУпаковки,
	|	&ТекстЗапросаДоступностьКоэффициентУпаковки
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиНоменклатуры
	|		ПО (Номенклатура.ПлощадьИспользовать)
	|			И (Номенклатура.ПлощадьМожноУказыватьВДокументах)
	|			И (УпаковкиНоменклатуры.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Площадь))
	|ГДЕ
	|	Номенклатура.Ссылка = &Номенклатура
	|	И (&ПоказыватьМерныеЕдиницыИзмерения
	|			ИЛИ Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Площадь))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УпаковкиНоменклатуры.Ссылка,
	|	УпаковкиНоменклатуры.ПометкаУдаления,
	|	УпаковкиНоменклатуры.Наименование,
	|	ЛОЖЬ,
	|	7,
	|	&ТекстЗапросаКоэффициентУпаковки,
	|	&ТекстЗапросаДоступностьКоэффициентУпаковки
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиНоменклатуры
	|		ПО (УпаковкиНоменклатуры.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Мощность))
	|ГДЕ
	|	Номенклатура.Ссылка = &Номенклатура
	|	И Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Мощность)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УпаковкиНоменклатуры.Ссылка,
	|	УпаковкиНоменклатуры.ПометкаУдаления,
	|	УпаковкиНоменклатуры.Наименование,
	|	ЛОЖЬ,
	|	8,
	|	&ТекстЗапросаКоэффициентУпаковки,
	|	&ТекстЗапросаДоступностьКоэффициентУпаковки
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиНоменклатуры
	|		ПО (УпаковкиНоменклатуры.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Энергия))
	|ГДЕ
	|	Номенклатура.Ссылка = &Номенклатура
	|	И Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Энергия)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УпаковкиНоменклатуры.Ссылка,
	|	УпаковкиНоменклатуры.ПометкаУдаления,
	|	УпаковкиНоменклатуры.Наименование,
	|	ЛОЖЬ,
	|	9,
	|	&ТекстЗапросаКоэффициентУпаковки,
	|	&ТекстЗапросаДоступностьКоэффициентУпаковки
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиНоменклатуры
	|		ПО (УпаковкиНоменклатуры.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.ЭлектрическийЗаряд))
	|ГДЕ
	|	Номенклатура.Ссылка = &Номенклатура
	|	И Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.ЭлектрическийЗаряд)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УпаковкиНоменклатуры.Ссылка,
	|	УпаковкиНоменклатуры.ПометкаУдаления,
	|	УпаковкиНоменклатуры.Наименование,
	|	ЛОЖЬ,
	|	10,
	|	&ТекстЗапросаКоэффициентУпаковки,
	|	&ТекстЗапросаДоступностьКоэффициентУпаковки
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиНоменклатуры
	|		ПО (УпаковкиНоменклатуры.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Время))
	|ГДЕ
	|	Номенклатура.Ссылка = &Номенклатура
	|	И Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Время)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СпрУпаковки.Ссылка,
	|	СпрУпаковки.ПометкаУдаления,
	|	СпрУпаковки.Наименование,
	|	ЛОЖЬ,
	|	1,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СпрУпаковки.Знаменатель, 0) = 0
	|			ТОГДА СпрУпаковки.Числитель
	|		ИНАЧЕ СпрУпаковки.Числитель / СпрУпаковки.Знаменатель
	|	КОНЕЦ,
	|	ИСТИНА
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК СпрУпаковки
	|		ПО (ВЫБОР
	|				КОГДА СпрНоменклатура.НаборУпаковок = ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ИндивидуальныйДляНоменклатуры)
	|					ТОГДА СпрУпаковки.Владелец = СпрНоменклатура.Ссылка
	|				КОГДА СпрНоменклатура.НаборУпаковок <> ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ПустаяСсылка)
	|					ТОГДА СпрУпаковки.Владелец = СпрНоменклатура.НаборУпаковок
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|ГДЕ
	|	СпрНоменклатура.Ссылка = &Номенклатура
	|	И НЕ СпрУпаковки.ПометкаУдаления
	|	И СпрУпаковки.ТипУпаковки <> ЗНАЧЕНИЕ(Перечисление.ТипыУпаковокНоменклатуры.ТоварноеМесто)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СпрУпаковки.Ссылка,
	|	СпрУпаковки.ПометкаУдаления,
	|	СпрУпаковки.Наименование,
	|	ЛОЖЬ,
	|	1,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СпрУпаковки.Знаменатель, 0) = 0
	|			ТОГДА СпрУпаковки.Числитель
	|		ИНАЧЕ СпрУпаковки.Числитель / СпрУпаковки.Знаменатель
	|	КОНЕЦ,
	|	ИСТИНА
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК СпрУпаковки
	|		ПО (ВЫБОР
	|				КОГДА СпрНоменклатура.НаборУпаковок = ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ИндивидуальныйДляНоменклатуры)
	|					ТОГДА СпрУпаковки.Владелец = СпрНоменклатура.Ссылка
	|				КОГДА СпрНоменклатура.НаборУпаковок <> ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ПустаяСсылка)
	|					ТОГДА СпрУпаковки.Владелец = СпрНоменклатура.НаборУпаковок
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|ГДЕ
	|	СпрНоменклатура.Ссылка = &Номенклатура
	|	И НЕ СпрУпаковки.ПометкаУдаления
	|	И &ПоказыватьТоварныеМеста
	|	И СпрУпаковки.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковокНоменклатуры.ТоварноеМесто)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Номенклатура.ЕдиницаИзмерения,
	|	Номенклатура.ЕдиницаИзмерения.ПометкаУдаления,
	|	Номенклатура.ЕдиницаИзмерения.Наименование,
	|	ИСТИНА,
	|	1,
	|	1,
	|	ИСТИНА
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Номенклатура
	|	И (&ДобавлятьЕдиницуХранения
	|			ИЛИ Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
	|			ИЛИ Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Объем)
	|			ИЛИ Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Длина)
	|			ИЛИ Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Площадь)
	|			ИЛИ Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Мощность)
	|			ИЛИ Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Энергия)
	|			ИЛИ Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.ЭлектрическийЗаряд)
	|			ИЛИ Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Время))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УпаковкиЕдиницыИзмерения.Ссылка КАК Упаковка,
	|	УпаковкиЕдиницыИзмерения.ПометкаУдаления КАК ПометкаУдаления,
	|	МАКСИМУМ(УпаковкиЕдиницыИзмерения.ЭтоЕдиницаХранения) КАК ЭтоЕдиницаХранения,
	|	УпаковкиЕдиницыИзмерения.Наименование КАК УпаковкаПредставление,
	|	МИНИМУМ(УпаковкиЕдиницыИзмерения.Порядок) КАК Порядок,
	|	УпаковкиЕдиницыИзмерения.Коэффициент КАК Коэффициент,
	|	УпаковкиЕдиницыИзмерения.ДопустимыйКоэффициент КАК ДопустимыйКоэффициент
	|ИЗ
	|	УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	|ГДЕ
	|	&УсловиеПоСтрокеПоиска
	|	И УпаковкиЕдиницыИзмерения.ДопустимыйКоэффициент
	|
	|СГРУППИРОВАТЬ ПО
	|	УпаковкиЕдиницыИзмерения.Ссылка,
	|	УпаковкиЕдиницыИзмерения.ПометкаУдаления,
	|	УпаковкиЕдиницыИзмерения.Наименование,
	|	УпаковкиЕдиницыИзмерения.Коэффициент,
	|	УпаковкиЕдиницыИзмерения.ДопустимыйКоэффициент
	|
	|УПОРЯДОЧИТЬ ПО
	|	МИНИМУМ(УпаковкиЕдиницыИзмерения.Порядок),
	|	УпаковкиЕдиницыИзмерения.Коэффициент УБЫВ,
	|	УпаковкиЕдиницыИзмерения.Наименование";	
	
	
	//"ВЫБРАТЬ
	//|	УпаковкиНоменклатуры.Ссылка КАК Ссылка,
	//|	УпаковкиНоменклатуры.ПометкаУдаления КАК ПометкаУдаления,
	//|	УпаковкиНоменклатуры.Наименование КАК Наименование,
	//|	ЛОЖЬ КАК ЭтоЕдиницаХранения,
	//|	3 КАК Порядок,
	//|	&ТекстЗапросаКоэффициентУпаковки КАК Коэффициент,
	//|	&ТекстЗапросаДоступностьКоэффициентУпаковки КАК ДопустимыйКоэффициент
	//|ПОМЕСТИТЬ УпаковкиЕдиницыИзмерения
	//|ИЗ
	//|	Справочник.Номенклатура КАК Номенклатура
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиНоменклатуры
	//|		ПО Номенклатура.ВесИспользовать
	//|			И Номенклатура.ВесМожноУказыватьВДокументах
	//|			И УпаковкиНоменклатуры.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
	//|ГДЕ
	//|	Номенклатура.Ссылка = &Номенклатура
	//|	И (&ПоказыватьМерныеЕдиницыИзмерения
	//|		ИЛИ Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес))
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	УпаковкиНоменклатуры.Ссылка,
	//|	УпаковкиНоменклатуры.ПометкаУдаления,
	//|	УпаковкиНоменклатуры.Наименование,
	//|	ЛОЖЬ,
	//|	4,
	//|	&ТекстЗапросаКоэффициентУпаковки,
	//|	&ТекстЗапросаДоступностьКоэффициентУпаковки
	//|ИЗ
	//|	Справочник.Номенклатура КАК Номенклатура
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиНоменклатуры
	//|		ПО Номенклатура.ОбъемИспользовать
	//|			И Номенклатура.ОбъемМожноУказыватьВДокументах
	//|			И УпаковкиНоменклатуры.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Объем)
	//|ГДЕ
	//|	Номенклатура.Ссылка = &Номенклатура
	//|	И (&ПоказыватьМерныеЕдиницыИзмерения
	//|		ИЛИ Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Объем))
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	УпаковкиНоменклатуры.Ссылка,
	//|	УпаковкиНоменклатуры.ПометкаУдаления,
	//|	УпаковкиНоменклатуры.Наименование,
	//|	ЛОЖЬ,
	//|	5,
	//|	&ТекстЗапросаКоэффициентУпаковки,
	//|	&ТекстЗапросаДоступностьКоэффициентУпаковки
	//|ИЗ
	//|	Справочник.Номенклатура КАК Номенклатура
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиНоменклатуры
	//|		ПО Номенклатура.ДлинаИспользовать
	//|			И Номенклатура.ДлинаМожноУказыватьВДокументах
	//|			И УпаковкиНоменклатуры.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Длина)
	//|ГДЕ
	//|	Номенклатура.Ссылка = &Номенклатура
	//|	И (&ПоказыватьМерныеЕдиницыИзмерения
	//|		ИЛИ Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Длина))
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	УпаковкиНоменклатуры.Ссылка,
	//|	УпаковкиНоменклатуры.ПометкаУдаления,
	//|	УпаковкиНоменклатуры.Наименование,
	//|	ЛОЖЬ,
	//|	6,
	//|	&ТекстЗапросаКоэффициентУпаковки,
	//|	&ТекстЗапросаДоступностьКоэффициентУпаковки
	//|ИЗ
	//|	Справочник.Номенклатура КАК Номенклатура
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиНоменклатуры
	//|		ПО Номенклатура.ПлощадьИспользовать
	//|			И Номенклатура.ПлощадьМожноУказыватьВДокументах
	//|			И УпаковкиНоменклатуры.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Площадь)
	//|ГДЕ
	//|	Номенклатура.Ссылка = &Номенклатура
	//|	И (&ПоказыватьМерныеЕдиницыИзмерения
	//|		ИЛИ Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Площадь))
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	УпаковкиНоменклатуры.Ссылка,
	//|	УпаковкиНоменклатуры.ПометкаУдаления,
	//|	УпаковкиНоменклатуры.Наименование,
	//|	ЛОЖЬ,
	//|	7,
	//|	&ТекстЗапросаКоэффициентУпаковки,
	//|	&ТекстЗапросаДоступностьКоэффициентУпаковки
	//|ИЗ
	//|	Справочник.Номенклатура КАК Номенклатура
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиНоменклатуры
	//|		ПО УпаковкиНоменклатуры.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Мощность)
	//|ГДЕ
	//|	Номенклатура.Ссылка = &Номенклатура
	//|	И Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Мощность)
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	УпаковкиНоменклатуры.Ссылка,
	//|	УпаковкиНоменклатуры.ПометкаУдаления,
	//|	УпаковкиНоменклатуры.Наименование,
	//|	ЛОЖЬ,
	//|	8,
	//|	&ТекстЗапросаКоэффициентУпаковки,
	//|	&ТекстЗапросаДоступностьКоэффициентУпаковки
	//|ИЗ
	//|	Справочник.Номенклатура КАК Номенклатура
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиНоменклатуры
	//|		ПО УпаковкиНоменклатуры.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Энергия)
	//|ГДЕ
	//|	Номенклатура.Ссылка = &Номенклатура
	//|	И Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Энергия)
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	УпаковкиНоменклатуры.Ссылка,
	//|	УпаковкиНоменклатуры.ПометкаУдаления,
	//|	УпаковкиНоменклатуры.Наименование,
	//|	ЛОЖЬ,
	//|	9,
	//|	&ТекстЗапросаКоэффициентУпаковки,
	//|	&ТекстЗапросаДоступностьКоэффициентУпаковки
	//|ИЗ
	//|	Справочник.Номенклатура КАК Номенклатура
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиНоменклатуры
	//|		ПО УпаковкиНоменклатуры.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.ЭлектрическийЗаряд)
	//|ГДЕ
	//|	Номенклатура.Ссылка = &Номенклатура
	//|	И Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.ЭлектрическийЗаряд)
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	УпаковкиНоменклатуры.Ссылка,
	//|	УпаковкиНоменклатуры.ПометкаУдаления,
	//|	УпаковкиНоменклатуры.Наименование,
	//|	ЛОЖЬ,
	//|	10,
	//|	&ТекстЗапросаКоэффициентУпаковки,
	//|	&ТекстЗапросаДоступностьКоэффициентУпаковки
	//|ИЗ
	//|	Справочник.Номенклатура КАК Номенклатура
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиНоменклатуры
	//|		ПО УпаковкиНоменклатуры.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Время)
	//|ГДЕ
	//|	Номенклатура.Ссылка = &Номенклатура
	//|	И Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Время)
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	СпрУпаковки.Ссылка,
	//|	СпрУпаковки.ПометкаУдаления,
	//|	СпрУпаковки.Наименование,
	//|	ЛОЖЬ,
	//|	1,
	//|	СпрУпаковки.Числитель / СпрУпаковки.Знаменатель,
	//|	ИСТИНА
	//|ИЗ
	//|	Справочник.Номенклатура КАК СпрНоменклатура
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК СпрУпаковки
	//|		ПО (ВЫБОР
	//|				КОГДА СпрНоменклатура.НаборУпаковок = ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ИндивидуальныйДляНоменклатуры)
	//|					ТОГДА СпрУпаковки.Владелец = СпрНоменклатура.Ссылка
	//|				КОГДА СпрНоменклатура.НаборУпаковок <> ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ПустаяСсылка)
	//|					ТОГДА СпрУпаковки.Владелец = СпрНоменклатура.НаборУпаковок
	//|				ИНАЧЕ ЛОЖЬ
	//|			КОНЕЦ)
	//|ГДЕ
	//|	СпрНоменклатура.Ссылка = &Номенклатура
	//|	И НЕ СпрУпаковки.ПометкаУдаления
	//|	И СпрУпаковки.ТипУпаковки <> ЗНАЧЕНИЕ(Перечисление.ТипыУпаковокНоменклатуры.ТоварноеМесто)
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	СпрУпаковки.Ссылка,
	//|	СпрУпаковки.ПометкаУдаления,
	//|	СпрУпаковки.Наименование,
	//|	ЛОЖЬ,
	//|	1,
	//|	СпрУпаковки.Числитель / СпрУпаковки.Знаменатель,
	//|	ИСТИНА
	//|ИЗ
	//|	Справочник.Номенклатура КАК СпрНоменклатура
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК СпрУпаковки
	//|		ПО (ВЫБОР
	//|				КОГДА СпрНоменклатура.НаборУпаковок = ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ИндивидуальныйДляНоменклатуры)
	//|					ТОГДА СпрУпаковки.Владелец = СпрНоменклатура.Ссылка
	//|				КОГДА СпрНоменклатура.НаборУпаковок <> ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ПустаяСсылка)
	//|					ТОГДА СпрУпаковки.Владелец = СпрНоменклатура.НаборУпаковок
	//|				ИНАЧЕ ЛОЖЬ
	//|			КОНЕЦ)
	//|ГДЕ
	//|	СпрНоменклатура.Ссылка = &Номенклатура
	//|	И НЕ СпрУпаковки.ПометкаУдаления
	//|	И &ПоказыватьТоварныеМеста
	//|	И СпрУпаковки.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковокНоменклатуры.ТоварноеМесто)
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	Номенклатура.ЕдиницаИзмерения,
	//|	Номенклатура.ЕдиницаИзмерения.ПометкаУдаления,
	//|	Номенклатура.ЕдиницаИзмерения.Наименование,
	//|	ИСТИНА,
	//|	1,
	//|	1,
	//|	ИСТИНА
	//|ИЗ
	//|	Справочник.Номенклатура КАК Номенклатура
	//|ГДЕ
	//|	Номенклатура.Ссылка = &Номенклатура
	//|	И (&ДобавлятьЕдиницуХранения
	//|			ИЛИ Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
	//|			ИЛИ Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Объем)
	//|			ИЛИ Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Длина)
	//|			ИЛИ Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Площадь)
	//|			ИЛИ Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Мощность)
	//|			ИЛИ Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Энергия)
	//|			ИЛИ Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.ЭлектрическийЗаряд)
	//|			ИЛИ Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Время))
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	УпаковкиЕдиницыИзмерения.Ссылка КАК Упаковка,
	//|	УпаковкиЕдиницыИзмерения.ПометкаУдаления КАК ПометкаУдаления,
	//|	МАКСИМУМ(УпаковкиЕдиницыИзмерения.ЭтоЕдиницаХранения) КАК ЭтоЕдиницаХранения,
	//|	УпаковкиЕдиницыИзмерения.Наименование КАК УпаковкаПредставление,
	//|	МИНИМУМ(УпаковкиЕдиницыИзмерения.Порядок) КАК Порядок,
	//|	УпаковкиЕдиницыИзмерения.Коэффициент,
	//|	УпаковкиЕдиницыИзмерения.ДопустимыйКоэффициент
	//|ИЗ
	//|	УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	//|ГДЕ
	//|	&УсловиеПоСтрокеПоиска
	//|	И УпаковкиЕдиницыИзмерения.ДопустимыйКоэффициент
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	УпаковкиЕдиницыИзмерения.Ссылка,
	//|	УпаковкиЕдиницыИзмерения.ПометкаУдаления,
	//|	УпаковкиЕдиницыИзмерения.Наименование,
	//|	УпаковкиЕдиницыИзмерения.Коэффициент,
	//|	УпаковкиЕдиницыИзмерения.ДопустимыйКоэффициент
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	МИНИМУМ(УпаковкиЕдиницыИзмерения.Порядок),
	//|	УпаковкиЕдиницыИзмерения.Коэффициент УБЫВ,
	//|	УпаковкиЕдиницыИзмерения.Наименование";
	
	Запрос.УстановитьПараметр("ДобавлятьЕдиницуХранения", ДобавлятьЕдиницуХранения);
	Запрос.УстановитьПараметр("ПоказыватьМерныеЕдиницыИзмерения", ПоказыватьМерныеЕдиницыИзмерения);
	Запрос.УстановитьПараметр("ПоказыватьТоварныеМеста", ПоказыватьТоварныеМеста);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,
	"&УсловиеПоСтрокеПоиска",
	?(СтрокаПоиска = Неопределено, "ИСТИНА", " УпаковкиЕдиницыИзмерения.Наименование ПОДОБНО &СтрокаПоиска"));
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,
	"&ТекстЗапросаКоэффициентУпаковки",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковкиДляВыбора(
	"УпаковкиНоменклатуры",
	"Номенклатура"));
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,
	"&ТекстЗапросаДоступностьКоэффициентУпаковки",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаДоступностьКоэффициентаДляВыбораУпаковки(
	"УпаковкиНоменклатуры",
	"Номенклатура"));
	
	Если СтрокаПоиска <> Неопределено Тогда
		Запрос.УстановитьПараметр("СтрокаПоиска", СтрокаПоиска + "%");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ЭтоЕдиницаХранения Тогда
			ДанныеВыбора.Добавить(Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка(), Выборка.УпаковкаПредставление);
		Иначе
			ЗначениеСписка = Новый Структура;
			ЗначениеСписка.Вставить("Значение", Выборка.Упаковка);
			ЗначениеСписка.Вставить("ПометкаУдаления", Выборка.ПометкаУдаления);
			ДанныеВыбора.Добавить(ЗначениеСписка, Выборка.УпаковкаПредставление);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
