
&После("ПередЗаписью")
Процедура Р1_ПередЗаписью(Отказ)
	
	Если Не ЭтотОбъект.ЭтоГруппа Тогда
	
		Если Не ЗначениеЗаполнено(ЭтотОбъект.ГруппаАналитическогоУчета) Тогда
			
			ЭлементГруппаФинансовогоУчета = Справочники.ГруппыАналитическогоУчетаНоменклатуры.СоздатьЭлемент();
			ЭлементГруппаФинансовогоУчета.Наименование = ЭтотОбъект.Наименование;
			ЭлементГруппаФинансовогоУчета.Записать();
			
			ЭтотОбъект.ГруппаАналитическогоУчета = ЭлементГруппаФинансовогоУчета.Ссылка;
				
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ГруппаДоступа) Тогда
			ГруппаДоступа = Справочники.ГруппыДоступаНоменклатуры.НайтиПоНаименованию("Основная");	
		КонецЕсли;
	
	КонецЕсли;
	
	
КонецПроцедуры
