Перем СообщениеОбИзменениях  Экспорт;
Перем ПредРаботаЦПБЗавершена;  //0021215
Перем ПредРаботаОККЗавершена;

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если ЭтоНовый() Тогда
			Дата = ТекущаяДатаСеанса();
		КонецЕсли;
	КонецЕсли;  
	
	////определяем изменения в документе
	//СообщениеОбИзменениях = "";
	//ТекСообщ = "";
	//Для каждого Стр Из ТЧ_Показатели Цикл
	//	Если Ссылка.ТЧ_Показатели.Количество()>=Стр.НомерСтроки Тогда
	//		СтрСсылка = Ссылка.ТЧ_Показатели.Получить(Стр.НомерСтроки-1);
	//		ТекСообщ = "";
	//		Если Стр.Показатель <> СтрСсылка.Показатель Тогда
	//			ТекСообщ = ТекСообщ + "Изменился вид показателя: был "+СтрСсылка.Показатель+" стал "+ Стр.Показатель+Символы.ПС;
	//		КонецЕсли; 
	//		Если Стр.ЗначениеПоказателяОтНасНачальные <> СтрСсылка.ЗначениеПоказателяОтНасНачальные Тогда
	//			ТекСообщ = ТекСообщ + "Изменилось значение показателя: было "+СтрСсылка.ЗначениеПоказателя+" стало "+ Стр.ЗначениеПоказателя+Символы.ПС;
	//		КонецЕсли;
	//	Иначе	
	//		ТекСообщ = ТекСообщ + "Добавили вид показателя: "+ Стр.Показатель+Символы.ПС;
	//	КонецЕсли; 
	//	//если были изменения в этой строке - вставляем номер строки
	//	Если НЕ ТекСообщ = "" Тогда
	//		ТекСообщ = "Изменения в строке "+Стр.НомерСтроки+Символы.ПС+ТекСообщ;
	//		СообщениеОбИзменениях = Символы.ПС+СообщениеОбИзменениях + ТекСообщ;
	//	КонецЕсли; 
	//КонецЦикла; 
	
	//0018062	
	//устанавливаем историю, если надо
	Надо = Ложь;
	Если История.Количество() = 0 Тогда
		Надо = Истина;
	Иначе
		ПослСтатус = История[История.Количество()-1].Статус;
		Если НЕ ПослСтатус = Статус Тогда
			Надо = Истина;
		КонецЕсли; 
	КонецЕсли;
	
	Если ПредРаботаОККЗавершена<>РаботаОККПоРазногласиямЗавершена Тогда
		Надо = Истина;
	КонецЕсли; 
	Если ПредРаботаЦПБЗавершена<>РаботаЦИРПоРазногласиямЗавершена Тогда
		Надо = Истина;
	КонецЕсли;
	
	Если Надо Тогда
		НовСтр = История.Добавить();
		НовСтр.Дата = ТекущаяДатаСеанса();
		НовСтр.Ответственный = Пользователи.ТекущийПользователь();;
		НовСтр.Статус = Статус;
		
		НовСтр.РаботаЦПБЗавершена = РаботаЦИРПоРазногласиямЗавершена;
		НовСтр.РаботаОККЗавершена = РаботаОККПоРазногласиямЗавершена;
	КонецЕсли; 
	
	НоменклатураСтрокой = Номенклатура;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Утверждение.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.УтверждениеНорматива КАК Утверждение
	|ГДЕ
	|	Утверждение.ТребованияККачеству = &Требование
	|	И НЕ Утверждение.ПометкаУдаления
	|	И (Утверждение.Производитель <> &Производитель
	|			ИЛИ Утверждение.Поставщик <> &Поставщик)";
	Запрос.УстановитьПараметр("Требование", Ссылка);
	Запрос.УстановитьПараметр("Поставщик", Поставщик);
	Запрос.УстановитьПараметр("Производитель", Производитель);
	
	Рез = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Стр Из Рез Цикл
		КК = Рез[0].Ссылка.ПолучитьОбъект();
		КК.Поставщик = Поставщик;
		КК.Производитель = Производитель;
		КК.Записать();
		Сообщить("Обновлен документ " + КК.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// регистр НормативыНоменклатурыЛаб
	
	Если Статус = Перечисления.СтатусЗаявки.Согласована Тогда
		Движения.НормативыНоменклатурыЛаб.Записывать = Истина;
		Для Каждого ТекСтрокаПоказатели Из Показатели Цикл
			Если НЕ ЗначениеЗаполнено(ТекСтрокаПоказатели.ВидИсследования) Тогда
				Продолжить;
			КонецЕсли; 
			Если НЕ ЗначениеЗаполнено(ТекСтрокаПоказатели.Показатель) Тогда
				Продолжить;
			КонецЕсли;		
			
			Движение = Движения.НормативыНоменклатурыЛаб.Добавить();
			Движение.Период = Дата;
			Движение.Номенклатура = Номенклатура;
			Движение.ВидИсследования = ТекСтрокаПоказатели.ВидИсследования;
			Движение.Показатель = ТекСтрокаПоказатели.Показатель;
			Движение.Поставщик = Поставщик;
			Движение.ХарактеристикаНорматива = ТекСтрокаПоказатели.ХарактеристикаНорматива;
			Движение.ВариантСравнения = ТекСтрокаПоказатели.ВариантСравнения;
			Движение.ЕдиницаИзмерения = ТекСтрокаПоказатели.ЕдиницаИзмерения;
			Движение.Значение = ТекСтрокаПоказатели.ЗначениеПоказателяКонечные;
			Движение.Интервал = ТекСтрокаПоказатели.Интервал;
			Движение.наАнглийскомЯзыке = ТекСтрокаПоказатели.ЗначениеПоказателяАнглийский;
			Движение.Лаборатория = ТекСтрокаПоказатели.Лаборатория;
			Движение.Периодичность = ТекСтрокаПоказатели.Периодичность;
			Движение.Комментарий = Комментарий;
		КонецЦикла;
	КонецЕсли; 
	
КонецПроцедуры

ПредРаботаЦПБЗавершена = Ссылка.РаботаЦИРПоРазногласиямЗавершена; //без ссылки - всегда ложь возвращается
ПредРаботаОККЗавершена = Ссылка.РаботаОККПоРазногласиямЗавершена;