
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Номенклатура") Тогда
		Номенклатура = Параметры.Номенклатура;
		//Серия = Параметры.Серия;
		Склад = Параметры.Склад;
	КонецЕсли;
	
	Если Параметры.Свойство("ИдентификаторСтроки") Тогда
		ИдентификаторСтроки = Параметры.ИдентификаторСтроки;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	
	Если ЗначениеЗаполнено(Склад) Тогда
		Запрос.Текст = "ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК Количество,
		|	ТоварыНаСкладахОстатки.Серия КАК Серия,
		|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(
		|			,
		|			Номенклатура = &Номенклатура
		|				И Склад = &Склад) КАК ТоварыНаСкладахОстатки";
		
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("Склад", Склад);	
	Иначе		
		Запрос.Текст = "ВЫБРАТЬ
		|	СерииНоменклатуры.Ссылка КАК Серия
		|ИЗ
		|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
		|ГДЕ
		|	СерииНоменклатуры.ВидНоменклатуры = &ВидНоменклатуры";
		
		Запрос.УстановитьПараметр("ВидНоменклатуры", Номенклатура.ВидНоменклатуры);
	КонецЕсли; 
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ОстаткиСерий.Очистить();
	Пока Выборка.Следующий() Цикл
		
		НовСтр = ОстаткиСерий.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиСерийПередНачаломИзменения(Элемент, Отказ)
	ОповеститьО();
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	ОповеститьО();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьО()
	
	ТекДанные = Элементы.ОстаткиСерий.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ВыбранноеЗначение = Новый Структура("Номенклатура, Серия, Выбрали, ИдентификаторСтроки", Номенклатура, ТекДанные.Серия, Истина, ИдентификаторСтроки);
	ОповеститьОВыборе(ВыбранноеЗначение);
	
КонецПроцедуры
 
