Процедура СформироватьШК(РисунокШтрихкода, РисунокШтрихкодаИсточник, ОбластьМакета, Штрихкоддокумента) Экспорт
	
	РисунокШтрихкода.Верх = РисунокШтрихкодаИсточник.Верх;
	РисунокШтрихкода.Лево = РисунокШтрихкодаИсточник.Лево;
	РисунокШтрихкода.Высота = РисунокШтрихкодаИсточник.Высота;
	РисунокШтрихкода.Ширина = РисунокШтрихкодаИсточник.Ширина;
	РисунокШтрихкода.Имя = РисунокШтрихкодаИсточник.Имя;
	РисунокШтрихкода.Линия = РисунокШтрихкодаИсточник.Линия;
	РисунокШтрихкода.РазмерКартинки = РазмерКартинки.Растянуть;
	
	ОбластьМакета.Рисунки.Удалить(РисунокШтрихкодаИсточник);
	
	ПараметрыШтрихкода = Новый Структура;
	ПараметрыШтрихкода.Вставить("Ширина", РисунокШтрихкодаИсточник.Ширина*3);
	ПараметрыШтрихкода.Вставить("Высота", РисунокШтрихкодаИсточник.Высота*3);
	ПараметрыШтрихкода.Вставить("Штрихкод", Штрихкоддокумента);
	//ПараметрыШтрихкода.Вставить("ТипКода", 1);
	ПараметрыШтрихкода.Вставить("ТипКода", 99);
	ПараметрыШтрихкода.Вставить("МонохромныйШрифт", Истина);
	ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
	ПараметрыШтрихкода.Вставить("РазмерШрифта", 9);
	ПараметрыШтрихкода.Вставить("Масштабировать", Истина);
	ПараметрыШтрихкода.Вставить("СохранятьПропорции", Ложь);
	ПараметрыШтрихкода.Вставить("ВертикальноеВыравнивание", 1);
	
	РисунокШтрихкода.Картинка=МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
	
КонецПроцедуры
