
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Перем ТЗНесоответствий;
	Если Не ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
	    Возврат;
	КонецЕсли; 	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПротоколАнализа") Тогда
		//Пытаемся найти уже созданные карты на основании этого протокола
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	КартаРазрешения.Ссылка
		|ИЗ
		|	Документ.КартаРазрешения КАК КартаРазрешения
		|ГДЕ
		|	КартаРазрешения.ДокументОснование = &ДокументОснование";
		
		Запрос.УстановитьПараметр("ДокументОснование", ДанныеЗаполнения);
		
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			Сообщить("На основании протокола "+ ДанныеЗаполнения+ " уже создан документ "+Выборка.ссылка);
			СтрандартнаяОбработка = ЛОжь;
			Возврат;
		КонецЕсли; 	
		
		ДокументОснование = ДанныеЗаполнения;
		ДокументПоступления = ДанныеЗаполнения.ДокументПоступления;
		КодПродукта = ДанныеЗаполнения.КодПродукта;
		Номенклатура = ДанныеЗаполнения.Номенклатура;
		ДатаВведения = ДанныеЗаполнения.Дата;
		ДатаОкончанияДействия = ДанныеЗаполнения.Номенклатура.СрокГодности;
		Партия = ДанныеЗаполнения.Серия;
		НомерЗамеса = ДанныеЗаполнения.НомерЗамеса;
		Организация = ДанныеЗаполнения.Организация;
		#Если Клиент Тогда
			Если Лаборатория_Сервер.гл_ОбразецСоответствуетНормативам(ДанныеЗаполнения, , ДанныеЗаполнения.ТЧ_Показатели.Выгрузить(), ТЗНесоответствий) Тогда
			Иначе
				Сообщить("Протокол не соответсвует нормативам!");
				СтандартнаяОбработка = ЛОжь;
			КонецЕсли;
		#КонецЕсли
		
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Принят Тогда
		
		Для Каждого ТекСтрокаТЧ_Показатели Из ТЧ_Показатели Цикл
			
			Для каждого Стр Из ТЧ_Показатели Цикл   
				Если НЕ ТипЗнч(Стр.Показатель) = Тип("ПланВидовХарактеристикСсылка.Нормативы") Тогда
					Продолжить;						
				КонецЕсли;
				МенЗап = РегистрыСведений.НормативыНоменклатурыЛаб.СоздатьМенеджерЗаписи();
				
				ЗаполнитьЗначенияСвойств(МенЗап, Стр);
				
				МенЗап.Активность = Истина;
				МенЗап.Период = Дата;
				МенЗап.Номенклатура = Номенклатура;
				МенЗап.Показатель = Стр.Показатель;
				
				МенЗап.ДатаОкончанияДействия = ДатаОкончанияДействия;
				
				Если ЗначениеЗаполнено(МенЗап.Показатель) Тогда
					МенЗап.ВидИсследования = МенЗап.Показатель.ВидИсследования;
					
					ТипЗначенияСвойства = МенЗап.Показатель.ТипЗначения;
					Если НЕ ТипЗначенияСвойства = Неопределено Тогда
						МенЗап.Значение = ТипЗначенияСвойства.ПривестиЗначение(МенЗап.Значение);
						
						ТипСтрока = Тип("Строка");
						ТипЧисло = Тип("Число");
						Если ТипЗначенияСвойства.СодержитТип(ТипСтрока) Тогда
							МенЗап.Значение = Стр.Значение;
						ИначеЕсли ТипЗначенияСвойства.СодержитТип(ТипЧисло) Тогда
							Попытка
								МенЗап.Значение = Число(Стр.Значение);
							Исключение
							КонецПопытки; 
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				Попытка
					МенЗап.Записать();
				Исключение
					Сообщить("не удалось записать норматив "+Стр.МетодИсследования);
				КонецПопытки; 
			КонецЦикла; 
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не ЗначениеЗаполнено(ВидНоменклатуры) Тогда
	    ВидНоменклатуры = Номенклатура.ВидНоменклатуры;
	КонецЕсли; 
	
КонецПроцедуры
