Функция ПолучитьЗначениеКонстанты(ИмяКонстанты) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Константы.Имя КАК Имя,
		|	Константы.Значение КАК Значение,
		|	Константы.Представление КАК Представление
		|ИЗ
		|	РегистрСведений.Константы КАК Константы
		|ГДЕ
		|	Константы.Имя = &Имя";
	Запрос.УстановитьПараметр("Имя", ИмяКонстанты);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Значение;
	КонецЦикла;

КонецФункции

