
&НаКлиенте
Процедура РеквизитГруппыТоваровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	ВыбратьГруппуКлиент(ВыбраннаяСтрока);
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьГруппуКлиент(пВыбранаГруппаТоваров)
	 НоваяСтрока = ВыбранныеГруппы.Добавить();
	 НоваяСтрока.ГруппаТоваров = пВыбранаГруппаТоваров;
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыбрать(Команда) 
 	пВыбранаГруппаТоваров = Элементы.РеквизитГруппыТоваров.ТекущаяСтрока;
	ВыбратьГруппуКлиент(пВыбранаГруппаТоваров)
КонецПроцедуры

&НаКлиенте
Процедура КомандаПеренестиВДокумент(Команда)
	    АдресТоваровВХранилище = ПоместитьГруппыВХранилище();
		Структура = Новый Структура("АдресТоваровВХранилище", АдресТоваровВХранилище);
		ОповеститьОВыборе(Структура);
		
КонецПроцедуры

&НаСервере
Функция ПоместитьГруппыВХранилище()
	тГруппы = ВыбранныеГруппы.Выгрузить();
	АдресГруппВХранилище = ПоместитьВоВременноеХранилище(тГруппы,УникальныйИдентификатор);
	Возврат АдресГруппВХранилище;	
КонецФункции