Процедура ЗаполнитьНоменклатуру(Объект) Экспорт
	
	Объект.Номенклатуры.Очистить();	
	//заполняем все ном
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НоменклатураДополнительныеРеквизиты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|ГДЕ
	|	НоменклатураДополнительныеРеквизиты.Свойство = &Свойство
	|	И НоменклатураДополнительныеРеквизиты.Значение = &ГруппаДляПоказателейВТУ";
	
	Запрос.УстановитьПараметр("ГруппаДляПоказателейВТУ", Объект.ГруппаДляПоказателейВТУ);
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "ГруппаДляПоказателейВТУ"));
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Объект.Номенклатуры.Добавить().Номенклатура = Выборка.Ссылка;
	КонецЦикла;
	
	//УправлениеСвойствами.ЗначениеСвойства(Объект.Номенклатура, "ВидПродукции(ВЕТИС)_5ee632ef8afb4eabac5c5c3b4babd429");
	
КонецПроцедуры