
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Для каждого СтрНом Из Номенклатуры Цикл
		Если Не ЗначениеЗаполнено(СтрНом.Номенклатура) Тогда
			Продолжить;
		КонецЕсли; 
		
		Для каждого ТекСтрокаТЧ_Показатели Из ТЧ_Показатели Цикл
			Движение = Движения.ШаблоныЗначенийПоказателей.Добавить();
			Движение.Период = Дата;
			Движение.ВидИсследования = ВидИсследования;
			Движение.Показатель = ТекСтрокаТЧ_Показатели.Показатель;
			//Движение.Номенклатура = Номенклатура;
			Движение.Номенклатура = СтрНом.Номенклатура;
			Движение.Значение = ТекСтрокаТЧ_Показатели.Значение;
			Движение.наАнглийскомЯзыке = ТекСтрокаТЧ_Показатели.наАнглийскомЯзыке;
			Движение.ЕдиницаИзмерения = ТекСтрокаТЧ_Показатели.ЕдиницаИзмерения;
		КонецЦикла;
	КонецЦикла; 
	
	// записываем движения регистров
	Движения.ШаблоныЗначенийПоказателей.Записать();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	
	Если Не ЗначениеЗаполнено(Основание) Тогда
		Возврат;
	КонецЕсли; 	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПротоколАнализа") Тогда
		// Заполнение шапки
		Дата = НачалоДня(Основание.Дата)+60;
		Пользователь = Пользователь = Пользователи.ТекущийПользователь();//Основание.Пользователь;
		
		//заполняем всеми номенклатурами из группы
		//ГруппаТУ = Основание.Номенклатура.ГруппаДляПоказателейВТУ;
		Номенклатура = Основание.Номенклатура;
		ГруппаДляПоказателейВТУ = УправлениеСвойствами.ЗначениеСвойства(Номенклатура, "ГруппаДляПоказателейВТУ");
		
		ТУ = ГруппаДляПоказателейВТУ.Владелец;
		Документы.НастройкаЗначенийПоказателей.ЗаполнитьНоменклатуру(ЭтотОбъект);
		
		ВидИсследования = Основание.ВидИсследования;
		
		// Заполнение ТЧ показателей
		//не все показатели должны попадать в этот документа, а только те, у которых не стоит галочка "
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ПротоколАнализаТЧ_Показатели.Ссылка,
		|	ПротоколАнализаТЧ_Показатели.ЕдиницаИзмерения,
		|	ПротоколАнализаТЧ_Показатели.Значение,
		|	ПротоколАнализаТЧ_Показатели.Показатель,
		|	НормативыНоменклатурыЛабСрезПоследних.НеВыводитьВУК
		|ИЗ
		|	Документ.ПротоколАнализа.ТЧ_Показатели КАК ПротоколАнализаТЧ_Показатели
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НормативыНоменклатурыЛаб.СрезПоследних(&НаДату, ) КАК НормативыНоменклатурыЛабСрезПоследних
		|		ПО ПротоколАнализаТЧ_Показатели.Показатель = НормативыНоменклатурыЛабСрезПоследних.Показатель
		|			И ПротоколАнализаТЧ_Показатели.Ссылка.Номенклатура = НормативыНоменклатурыЛабСрезПоследних.Номенклатура
		|ГДЕ
		|	ПротоколАнализаТЧ_Показатели.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("НаДату", Основание.Дата);
		Запрос.УстановитьПараметр("Ссылка", Основание);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			//Для Каждого ТекСтрокаТЧ_Показатели Из Основание.ТЧ_Показатели Цикл
			Если Выборка.НеВыводитьВУК = Истина Тогда
				Продолжить;
			КонецЕсли; 
			НоваяСтрока = ТЧ_Показатели.Добавить();
			НоваяСтрока.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
			НоваяСтрока.Значение = Выборка.Значение;
			НоваяСтрока.Показатель = Выборка.Показатель;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
