
&НаКлиенте
Процедура ТЧ_ОбразцыПриАктивизацииСтроки(Элемент)
	
	Данные = Элементы.ТЧ_Образцы.ТекущиеДанные;
	Если Данные = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	//устанавливаем идентификатор если он пустой
	Если НЕ ЗначениеЗаполнено(Данные.ИдентификаторСтрОбразцы) Тогда 
		Данные.ИдентификаторСтрОбразцы = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	//устанавливаем отбор в подчиненных табличных частях
	Элементы.ТЧ_ВидыИсследований.ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторСтрокиТЧОбразцы", Данные.ИдентификаторСтрОбразцы);
	
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_ОбразцыПередУдалением(Элемент, Отказ)
	
	Данные = Элементы.ТЧ_Образцы.ТекущиеДанные;
	Отбор = Новый Структура("ИдентификаторСтрокиТЧОбразцы",Данные.ИдентификаторСтрОбразцы);
	Масс = Объект.ТЧ_ВидыИсследований.НайтиСтроки(Отбор);
	Для каждого Строка из Масс Цикл
		Объект.ТЧ_ВидыИсследований.Удалить(Строка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Первоначальное заполнение объекта.
	Если Параметры.Ключ.Пустая() Тогда
		
		Объект.Пользователь = Пользователи.ТекущийПользователь(); 
		
	КонецЕсли;
	
КонецПроцедуры
