
&НаСервере
Процедура ЗаполнитьНачальныеНастройкиНаСервере()

	ЗаписатьКонстанту("вт_ВидЦенПлановойСебестоимости", "Вид цен плановой себестоимости", 									Справочники.ВидыЦен.ПустаяСсылка());	
	ЗаписатьКонстанту("вт_ИспользоватьНовыйФорматСводкиПроизводства", "Использовать новый формат сводки производства (вт)", Ложь);	
	ЗаписатьКонстанту("вт_ОрганизацияПроизводства", "Основная организация производства", 									Справочники.Организации.ПустаяСсылка());	
	ЗаписатьКонстанту("вт_ОсновнойСклад", "Основной склад", 																Справочники.Склады.ПустаяСсылка());	
	ЗаписатьКонстанту("вт_ПодразделениеПроизводства", "Подразделение производства", 										Справочники.СтруктураПредприятия.ПустаяСсылка());	
	ЗаписатьКонстанту("вт_СкладБрака", "Склад брака продукции", 															Справочники.Склады.ПустаяСсылка());	
	ЗаписатьКонстанту("вт_СкладПроизводства", "Склад производства, готовой продукции", 										Справочники.Склады.ПустаяСсылка());	
	ЗаписатьКонстанту("вт_СтатьяДоходовПроизводство", "Статья доходов производство", 										ПланыВидовХарактеристик.СтатьиДоходов.ПустаяСсылка());	
	ЗаписатьКонстанту("вт_СтатьяРасходовЗарплата", "Статья расходов зарплата", 												ПланыВидовХарактеристик.СтатьиРасходов.ПустаяСсылка());	
	ЗаписатьКонстанту("вт_СтатьяРасходовОперации", "Статья расходов операции", 												ПланыВидовХарактеристик.СтатьиРасходов.ПустаяСсылка());	
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьКонстанту(Имя, Представление, Значение)

	МенеджерЗаписи = РегистрыСведений.Константы.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Имя = Имя;
	МенеджерЗаписи.Представление = Представление;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНачальныеНастройки(Команда)
	ЗаполнитьНачальныеНастройкиНаСервере();
КонецПроцедуры
