Функция ПредопределенныйЭлемент(Имя) Экспорт 

	Возврат ПредопреденныеДанныеНаСервере.ПолучитьПредопреденныеДанные("ВидыИсследований", Имя);

КонецФункции // ()

Функция ПолучитьПредопределенныеДанные() Экспорт 

	ТаблицаЗначений = Новый ТаблицаЗначений();
	ТаблицаЗначений.Колонки.Добавить("Наименование");
	ТаблицаЗначений.Колонки.Добавить("ПрефиксНумерации");
	ТаблицаЗначений.Колонки.Добавить("МассаОбразца");
	ТаблицаЗначений.Колонки.Добавить("Периодичность");       
	ТаблицаЗначений.Колонки.Добавить("ПорядокВывода");       
	
	НоваяСтрока = ТаблицаЗначений.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Новый Структура("Наименование", "Антибиотики"));
	НоваяСтрока = ТаблицаЗначений.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Новый Структура("Наименование", "Микотоксины"));
	НоваяСтрока = ТаблицаЗначений.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Новый Структура("Наименование", "Микробиологические исследования"));
	НоваяСтрока = ТаблицаЗначений.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Новый Структура("Наименование", "Органолептика"));
	НоваяСтрока = ТаблицаЗначений.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Новый Структура("Наименование", "Пестициды"));
	НоваяСтрока = ТаблицаЗначений.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Новый Структура("Наименование", "Радионуклиды"));
	НоваяСтрока = ТаблицаЗначений.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Новый Структура("Наименование", "Статистика"));
	НоваяСтрока = ТаблицаЗначений.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Новый Структура("Наименование", "Токсичность"));
	НоваяСтрока = ТаблицаЗначений.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Новый Структура("Наименование", "Физико-химические исследования"));
	НоваяСтрока = ТаблицаЗначений.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Новый Структура("Наименование", "Функциональные свойства"));

	Возврат ТаблицаЗначений;
	
КонецФункции // ()

